[Run]
  Gamepath=D:\data\_sty_bak\sty\project\_c++\jysdl-bh\vc6\game\
  ;0简体1繁体
  language=0
  ;游戏数据语言编码0为GB，1为big5
  datacode=0
  checkupdate=0
  IniVersion=1052
firstrun=0
leftcolumn=0
talkcode=1
talkinvert=0

[File]
  ;256调色板
  Palette=data\mmap.col

  ;可以查看的主要贴图文件
  FileNumber=8
  File0=data\hdgrp.idx,data\hdgrp.grp,头像贴图
  Section0=
  File1=data\Hore.idx,data\Hore.grp,新头像贴图
  Section1=
  File2=data\Hores.idx,data\Hores.grp,半身像贴图
  Section2=
  File3=data\thing.idx,data\thing.grp,新物品贴图
  Section3=
  File4=data\mmap.idx,data\mmap.grp,主地图贴图
  Section4=地面,0,701,表面,701,1001,建筑,1001,1501,人物,2501,2553,物品,3501,3701
  File5=data\SMAP.IDX,data\SMAP.GRP,场景贴图
  Section5= 
  File6=data\wdx,data\wmp,战斗贴图
  Section6=
  File7=data\eft.idx,data\eft.grp,武功效果
  Section7=
 
  FightNum=999
  ;战斗贴图 
  FightName=data\fight\Fight***.idx,data\fight\Fight***.grp,战斗贴图
  
  ;进度文件(对话事件战斗等编辑器缺省读取的进度文件)
  RIDX=data\ranger.idx,data\ranger.idx,ranger.idx,ranger.idx,ranger.idx,ranger.idx,Ranger.idx
  RGRP=data\Ranger.grp,data\save\R1.grp,R2.grp,R3.grp,R4.grp,R5.grp,R6.grp,R7.grp,R8.grp,R9.grp,R10.grp
  SIDX=data\allsin.idx,data\allsin.idx,allsin.idx,allsin.idx,allsin.idx,allsin.idx
  SGRP=data\allsin.grp,data\save\S1.grp,S2.grp,S3.grp,S4.grp,S5.grp,S6.grp,S7.grp,S8.grp,S9.grp,S10.grp
  DIDX=data\alldef.idx,data\alldef.idx,alldef.idx,alldef.idx,alldef.idx,alldef.idx
  DGRP=data\alldef.grp,data\save\D1.grp,D2.grp,D3.grp,D4.grp,D5.grp,D6.grp,D7.grp,D8.grp,D9.grp,D10.grp  
  RecordNote=新游戏进度,进度一,进度二,进度三,进度四,进度五,进度六,进度七,进度八,进度九,进度十

  ;对话文件
  TalkIDX=data\talk.idx
  TalkGRP=data\talk.grp
  ;战斗定义文件
  WarDefine =data\War.sta

 ;战斗地图结构文件
  WarMAPDefIDX=data\warfld.idx
  WarMAPDefGRP=data\warfld.grp
 
       
  ; 应写上合并后的文件名，如wdx/wmp。
  WarMapIDX=data\wdx
  WarMapGRP=data\wmp 

  ; 场景地图合并后的文件名，如sdx/smp。
    SMAPIDX=data\SMAP.IDX
    SMAPGRP=data\SMAP.GRP 
  
  ; 事件文件
  KdefIDx=data\Kdef.idx
  KdefGRP=data\Kdef.grp

     ; 主地图
    MMAPIDX =data\mmap.idx
    MMAPGRP =data\mmap.grp

    ; 主地图结构    
    MMAPStruct =data\earth.002,data\Surface.002,data\Building.002,data\Buildx.002,data\Buildy.002

    ;复刻专有文件
    Leave=list\leave.bin
    Effect=list\effect.bin
    Match=list\Match.bin 
    Exp=list\levelup.bin
warsmallmapsize=10
SceneMode=0
WarMode=0


[R_Modify]
    ; 修改R*数据
; 6 种数据
    TypeNumber = 7 
    
    TypeName0 =基本数据
    TypeDataItem0 =26
    ; 数组个数，数组结构成员个数，字节数，是否字串，是否名称，引用数据类型,名字，说明
    ; 间隔使用空格，一定要注意字符串中间不能有空格，而且空格只能有一个，等号后面不能有空格。
    Data(0,0) =1 1 4 0 0 -1 乘船 0主角不乘船/1主角乘船 
    data(0,1) =1 1 4 0 0 -1 无用 无用 
    data(0,2) =1 1 4 0 0 -1 人X 大地图人横坐标X(0-479) 
    data(0,3) =1 1 4 0 0 -1 人Y 大地图人纵坐标X(0-479) 
    data(0,4) =1 1 4 0 0 -1 人X1坐标 进入场景的横坐标X(0-63)，不用修改，进入场景自动变化 
    data(0,5) =1 1 4 0 0 -1 人Y1坐标 进入场景的纵坐标X(0-63)，不用修改，进入场景自动变化 
    data(0,6) =1 1 4 0 0 -1 人面对方向 0上1右2左3下,0
    data(0,7) =1 1 4 0 0 -1 船X 船X 
    data(0,8) =1 1 4 0 0 -1 船Y 船Y
    data(0,9) =1 1 4 0 0 -1 船X1 船X1
    data(0,10) =1 1 4 0 0 -1 船Y1 船Y1
    data(0,11) =1 1 4 0 0 -1 船面对方向 0上1右2左3下
    data(0,12) =1 1 4 0 0 -1 偏好人物1 扩展数据
    data(0,13) =1 1 4 0 0 -1 偏好人物2 扩展数据
    data(0,14) =1 1 4 0 0 -1 偏好人物3 扩展数据
    data(0,15) =1 1 4 0 0 -1 偏好人物4 扩展数据
    data(0,16) =1 1 4 0 0 -1 偏好人物5 扩展数据
    data(0,17) =1 1 4 0 0 -1 偏好武功1 扩展数据
    data(0,18) =1 1 4 0 0 -1 偏好武功2 扩展数据
    data(0,19) =1 1 4 0 0 -1 偏好武功3 扩展数据
    data(0,20) =1 1 4 0 0 -1 偏好武功4 扩展数据
    data(0,21) =1 1 4 0 0 -1 偏好武功5 扩展数据
    data(0,22) =1 1 4 0 0 -1 难度 难度
    data(0,23) =6 1 4 0 0 1 队友 队友(-1表示为空)，第一个必须是主角，不能修改
    data(0,24) =500 2 4 0 0 2 物品 物品(-1表示为空)
    data(0,25) =0 1 4 0 0 -1 物品个数 物品个数
    
    TypeName1 =人物
    TypedataItem1 = 166
    
    data(1,0) = 1 1 4 0 0 -1 代号 代号
    data(1,1) = 1 1 4 0 0 -1 头像/战斗代号 头像/战斗代号
    data(1,2) = 1 1 4 0 0 -1 生命增长 生命增长
    data(1,3) = 1 1 4 0 0 -1 剧情进度 剧情进度
    data(1,4) = 1 1 10 1 1 -1 姓名 姓名
    data(1,5) = 1 1 10 1 0 -1 外号 外号
    data(1,6) = 1 1 4 0 0 -1 性别 性别
    data(1,7) = 1 1 4 0 0 -1 等级 等级
    data(1,8) = 1 1 4 0 0 -1 经验值 经验值
    data(1,9) = 1 1 4 0 0 -1 生命 生命
    data(1,10) = 1 1 4 0 0 -1 生命最大值 生命最大值
    data(1,11) = 1 1 4 0 0 -1 受伤程度 受伤程度
    data(1,12) = 1 1 4 0 0 -1 中毒程度 中毒程度
    data(1,13) = 1 1 4 0 0 -1 体力 体力
    data(1,14) = 1 1 4 0 0 -1 物品修炼点数 物品修炼点数
    data(1,15) = 1 1 4 0 0 2 武器 武器
    data(1,16) = 1 1 4 0 0 2 防具 防具
    data(1,17) = 1 1 4 0 0 2 坐骑 坐骑
    data(1,18) = 1 1 4 0 0 4 装备内功 装备内功
    data(1,19) = 1 1 4 0 0 4 装备轻功 装备轻功
    data(1,20) = 1 1 4 0 0 -1 家族 家族
    data(1,21) = 1 1 4 0 0 -1 门派 门派
    data(1,22) = 1 1 4 0 0 -1 根骨 根骨
    data(1,23) = 1 1 4 0 0 -1 天賦武功 天賦武功
    data(1,24) = 1 1 4 0 0 -1 專精武功 專精武功
    data(1,25) = 1 1 4 0 0 -1 出招动画帧数 出招动画帧数
    data(1,26) = 1 1 4 0 0 -1 出招动画帧数 出招动画帧数
    data(1,27) = 1 1 4 0 0 -1 出招动画帧数 出招动画帧数
    data(1,28) = 1 1 4 0 0 -1 出招动画帧数 出招动画帧数
    data(1,29) = 1 1 4 0 0 -1 出招动画帧数 出招动画帧数
    data(1,30) = 1 1 4 0 0 -1 内力性质 内力性质
    data(1,31) = 1 1 4 0 0 -1 内力 内力
    data(1,32) = 1 1 4 0 0 -1 内力最大值 内力最大值
    data(1,33) = 1 1 4 0 0 -1 攻击力 攻击力
    data(1,34) = 1 1 4 0 0 -1 轻功 轻功
    data(1,35) = 1 1 4 0 0 -1 防御力 防御力
    data(1,36) = 1 1 4 0 0 -1 医疗 医疗
    data(1,37) = 1 1 4 0 0 -1 用毒 用毒
    data(1,38) = 1 1 4 0 0 -1 解毒 解毒
    data(1,39) = 1 1 4 0 0 -1 抗毒 抗毒
    data(1,40) = 1 1 4 0 0 -1 拳掌功夫 拳掌功夫
    data(1,41) = 1 1 4 0 0 -1 御剑能力 御剑能力
    data(1,42) = 1 1 4 0 0 -1 兵器技巧 兵器技巧
    data(1,43) = 1 1 4 0 0 -1 指腿功夫 指腿功夫
    data(1,44) = 1 1 4 0 0 -1 暗毒技巧 暗毒技巧
    data(1,45) = 1 1 4 0 0 -1 武学常识 武学常识
    data(1,46) = 1 1 4 0 0 -1 品德 品德
    data(1,47) = 1 1 4 0 0 -1 攻击带毒 攻击带毒
    data(1,48) = 1 1 4 0 0 -1 左右互搏 左右互搏
    data(1,49) = 1 1 4 0 0 -1 声望 声望
    data(1,50) = 1 1 4 0 0 -1 资质 资质
    data(1,51) = 1 1 4 0 0 2 修练物品 修练物品
    data(1,52) = 1 1 4 0 0 -1 修炼点数 修炼点数
    data(1,53) = 1 1 4 0 0 4 所会武功1 所会武功1
    data(1,54) = 1 1 4 0 0 4 所会武功2 所会武功2
    data(1,55) = 1 1 4 0 0 4 所会武功3 所会武功3
    data(1,56) = 1 1 4 0 0 4 所会武功4 所会武功4
    data(1,57) = 1 1 4 0 0 4 所会武功5 所会武功5
    data(1,58) = 1 1 4 0 0 4 所会武功6 所会武功6
    data(1,59) = 1 1 4 0 0 4 所会武功7 所会武功7
    data(1,60) = 1 1 4 0 0 4 所会武功8 所会武功8
    data(1,61) = 1 1 4 0 0 4 所会武功9 所会武功9
    data(1,62) = 1 1 4 0 0 4 所会武功10 所会武功10
    data(1,63) = 1 1 4 0 0 4 所会武功11 所会武功11
    data(1,64) = 1 1 4 0 0 4 所会武功12 所会武功12
    data(1,65) = 1 1 4 0 0 4 所会武功13 所会武功13
    data(1,66) = 1 1 4 0 0 4 所会武功14 所会武功14
    data(1,67) = 1 1 4 0 0 4 所会武功15 所会武功15
    data(1,68) = 1 1 4 0 0 4 所会武功16 所会武功16
    data(1,69) = 1 1 4 0 0 4 所会武功17 所会武功17
    data(1,70) = 1 1 4 0 0 4 所会武功18 所会武功18
    data(1,71) = 1 1 4 0 0 4 所会武功19 所会武功19
    data(1,72) = 1 1 4 0 0 4 所会武功20 所会武功20
    data(1,73) = 1 1 4 0 0 4 所会武功21 所会武功21
    data(1,74) = 1 1 4 0 0 4 所会武功22 所会武功22
    data(1,75) = 1 1 4 0 0 4 所会武功23 所会武功23
    data(1,76) = 1 1 4 0 0 4 所会武功24 所会武功24
    data(1,77) = 1 1 4 0 0 4 所会武功25 所会武功25
    data(1,78) = 1 1 4 0 0 4 所会武功26 所会武功26
    data(1,79) = 1 1 4 0 0 4 所会武功27 所会武功27
    data(1,80) = 1 1 4 0 0 4 所会武功28 所会武功28
    data(1,81) = 1 1 4 0 0 4 所会武功29 所会武功29
    data(1,82) = 1 1 4 0 0 4 所会武功30 所会武功30
    data(1,83) = 1 1 4 0 0 4 所会武功31 所会武功31
    data(1,84) = 1 1 4 0 0 4 所会武功32 所会武功32
    data(1,85) = 1 1 4 0 0 4 所会武功33 所会武功33
    data(1,86) = 1 1 4 0 0 4 所会武功34 所会武功34
    data(1,87) = 1 1 4 0 0 4 所会武功35 所会武功35
    data(1,88) = 1 1 4 0 0 4 所会武功36 所会武功36
    data(1,89) = 1 1 4 0 0 4 所会武功37 所会武功37
    data(1,90) = 1 1 4 0 0 4 所会武功38 所会武功38
    data(1,91) = 1 1 4 0 0 4 所会武功39 所会武功39
    data(1,92) = 1 1 4 0 0 4 所会武功40 所会武功40
    data(1,93) = 1 1 4 0 0 -1 所会武功1等级 所会武功1等级
    data(1,94) = 1 1 4 0 0 -1 所会武功2等级 所会武功2等级
    data(1,95) = 1 1 4 0 0 -1 所会武功3等级 所会武功3等级
    data(1,96) = 1 1 4 0 0 -1 所会武功4等级 所会武功4等级
    data(1,97) = 1 1 4 0 0 -1 所会武功5等级 所会武功5等级
    data(1,98) = 1 1 4 0 0 -1 所会武功6等级 所会武功6等级
    data(1,99) = 1 1 4 0 0 -1 所会武功7等级 所会武功7等级
    data(1,100) = 1 1 4 0 0 -1 所会武功8等级 所会武功8等级
    data(1,101) = 1 1 4 0 0 -1 所会武功9等级 所会武功9等级
    data(1,102) = 1 1 4 0 0 -1 所会武功10等级 所会武功10等级
    data(1,103) = 1 1 4 0 0 -1 所会武功11等级 所会武功11等级
    data(1,104) = 1 1 4 0 0 -1 所会武功12等级 所会武功12等级
    data(1,105) = 1 1 4 0 0 -1 所会武功13等级 所会武功13等级
    data(1,106) = 1 1 4 0 0 -1 所会武功14等级 所会武功14等级
    data(1,107) = 1 1 4 0 0 -1 所会武功15等级 所会武功15等级
    data(1,108) = 1 1 4 0 0 -1 所会武功16等级 所会武功16等级
    data(1,109) = 1 1 4 0 0 -1 所会武功17等级 所会武功17等级
    data(1,110) = 1 1 4 0 0 -1 所会武功18等级 所会武功18等级
    data(1,111) = 1 1 4 0 0 -1 所会武功19等级 所会武功19等级
    data(1,112) = 1 1 4 0 0 -1 所会武功20等级 所会武功20等级
    data(1,113) = 1 1 4 0 0 -1 所会武功21等级 所会武功21等级
    data(1,114) = 1 1 4 0 0 -1 所会武功22等级 所会武功22等级
    data(1,115) = 1 1 4 0 0 -1 所会武功23等级 所会武功23等级
    data(1,116) = 1 1 4 0 0 -1 所会武功24等级 所会武功24等级
    data(1,117) = 1 1 4 0 0 -1 所会武功25等级 所会武功25等级
    data(1,118) = 1 1 4 0 0 -1 所会武功26等级 所会武功26等级
    data(1,119) = 1 1 4 0 0 -1 所会武功27等级 所会武功27等级
    data(1,120) = 1 1 4 0 0 -1 所会武功28等级 所会武功28等级
    data(1,121) = 1 1 4 0 0 -1 所会武功29等级 所会武功29等级
    data(1,122) = 1 1 4 0 0 -1 所会武功30等级 所会武功30等级
    data(1,123) = 1 1 4 0 0 -1 所会武功31等级 所会武功31等级
    data(1,124) = 1 1 4 0 0 -1 所会武功32等级 所会武功32等级
    data(1,125) = 1 1 4 0 0 -1 所会武功33等级 所会武功33等级
    data(1,126) = 1 1 4 0 0 -1 所会武功34等级 所会武功34等级
    data(1,127) = 1 1 4 0 0 -1 所会武功35等级 所会武功35等级
    data(1,128) = 1 1 4 0 0 -1 所会武功36等级 所会武功36等级
    data(1,129) = 1 1 4 0 0 -1 所会武功37等级 所会武功37等级
    data(1,130) = 1 1 4 0 0 -1 所会武功38等级 所会武功38等级
    data(1,131) = 1 1 4 0 0 -1 所会武功39等级 所会武功39等级
    data(1,132) = 1 1 4 0 0 -1 所会武功40等级 所会武功40等级
    data(1,133) = 1 1 4 0 0 2 携带物品1 携带物品1
    data(1,134) = 1 1 4 0 0 2 携带物品2 携带物品2
    data(1,135) = 1 1 4 0 0 2 携带物品3 携带物品3
    data(1,136) = 1 1 4 0 0 2 携带物品4 携带物品4
    data(1,137) = 1 1 4 0 0 -1 携带物品1数量 携带物品1数量
    data(1,138) = 1 1 4 0 0 -1 携带物品2数量 携带物品2数量
    data(1,139) = 1 1 4 0 0 -1 携带物品3数量 携带物品3数量
    data(1,140) = 1 1 4 0 0 -1 携带物品4数量 携带物品4数量
    data(1,141) = 1 1 4 0 0 -1 戰績 戰績
    data(1,142) = 1 1 4 0 0 -1 招募難度 招募難度
    data(1,143) = 1 1 4 0 0 -1 出場難度 出場難度
    data(1,144) = 1 1 4 0 0 -1 攻擊熟練度 攻擊熟練度
    data(1,145) = 1 1 4 0 0 -1 防禦熟練度 防禦熟練度
    data(1,146) = 1 1 4 0 0 -1 底蘊 底蘊
    data(1,147) = 1 1 4 0 0 -1 商才 商才
    data(1,148) = 1 1 4 0 0 -1 成就控制1 成就控制1
    data(1,149) = 1 1 4 0 0 -1 成就控制2 成就控制2
    data(1,150) = 1 1 4 0 0 -1 成就控制3 成就控制3
    data(1,151) = 1 1 4 0 0 -1 成就控制4 成就控制4
    data(1,152) = 1 1 4 0 0 -1 成就控制5 成就控制5
    data(1,153) = 1 1 4 0 0 -1 成就控制6 成就控制6
    data(1,154) = 1 1 4 0 0 -1 成就控制7 成就控制7
    data(1,155) = 1 1 4 0 0 -1 成就控制8 成就控制8
    data(1,156) = 1 1 4 0 0 -1 成就控制9 成就控制9
    data(1,157) = 1 1 4 0 0 -1 成就控制10 成就控制10
    data(1,158) = 1 1 4 0 0 -1 成就控制11 成就控制11
    data(1,159) = 1 1 4 0 0 -1 成就控制12 成就控制12
    data(1,160) = 1 1 4 0 0 -1 成就控制13 成就控制13
    data(1,161) = 1 1 4 0 0 -1 成就控制14 成就控制14
    data(1,162) = 1 1 4 0 0 -1 成就控制15 成就控制15
    data(1,163) = 1 1 4 0 0 -1 成就控制16 成就控制16
    data(1,164) = 1 1 4 0 0 -1 成就控制17 成就控制17
    data(1,165) = 1 1 4 0 0 -1 成就控制18 成就控制18
	
	
    TypeName2 =物品
    TypedataItem2 = 75
    
    data(2,0) = 1 1 4 0 0 -1 代號 代號
    data(2,1) = 1 1 20 1 1 -1 物品名 物品名
    data(2,2) = 1 1 30 1 0 -1 物品說明 物品說明
    data(2,3) = 1 1 4 0 0 4 練出武功 練出武功
    data(2,4) = 1 1 4 0 0 -1 暗器動畫編號 暗器動畫編號
    data(2,5) = 1 1 4 0 0 1 使用人 使用人
    data(2,6) = 1 1 4 0 0 -1 裝備類型 裝備類型
    data(2,7) = 1 1 4 0 0 -1 顯示物品說明 顯示物品說明
    data(2,8) = 1 1 4 0 0 -1 類型 類型
    data(2,9) = 1 1 4 0 0 -1 装备等级 装备等级
    data(2,10) = 1 1 4 0 0 -1 家族限定 家族限定
    data(2,11) = 1 1 4 0 0 -1 门派限定 门派限定
    data(2,12) = 1 1 4 0 0 -1 引用事件 引用事件
    data(2,13) = 1 1 4 0 0 -1 加生命 加生命
    data(2,14) = 1 1 4 0 0 -1 加生命最大值 加生命最大值
    data(2,15) = 1 1 4 0 0 -1 加中毒解毒 加中毒解毒
    data(2,16) = 1 1 4 0 0 -1 加體力 加體力
    data(2,17) = 1 1 4 0 0 -1 改變內力性質 改變內力性質
    data(2,18) = 1 1 4 0 0 -1 加內力 加內力
    data(2,19) = 1 1 4 0 0 -1 加內力最大值 加內力最大值
    data(2,20) = 1 1 4 0 0 -1 加攻擊力 加攻擊力
    data(2,21) = 1 1 4 0 0 -1 加輕功 加輕功
    data(2,22) = 1 1 4 0 0 -1 加防禦力 加防禦力
    data(2,23) = 1 1 4 0 0 -1 加醫療 加醫療
    data(2,24) = 1 1 4 0 0 -1 加使毒 加使毒
    data(2,25) = 1 1 4 0 0 -1 加解毒 加解毒
    data(2,26) = 1 1 4 0 0 -1 加抗毒 加抗毒
    data(2,27) = 1 1 4 0 0 -1 加拳掌功夫 加拳掌功夫
    data(2,28) = 1 1 4 0 0 -1 加御剑能力 加御剑能力
    data(2,29) = 1 1 4 0 0 -1 加兵器技巧 加兵器技巧
    data(2,30) = 1 1 4 0 0 -1 加指腿功夫 加指腿功夫
    data(2,31) = 1 1 4 0 0 -1 加暗毒技巧 加暗毒技巧
    data(2,32) = 1 1 4 0 0 -1 加武學常識 加武學常識
    data(2,33) = 1 1 4 0 0 -1 加品德 加品德
    data(2,34) = 1 1 4 0 0 -1 加攻擊次數 加攻擊次數
    data(2,35) = 1 1 4 0 0 -1 加功夫帶毒 加功夫帶毒
    data(2,36) = 1 1 4 0 0 1 僅修煉人物 僅修煉人物
    data(2,37) = 1 1 4 0 0 -1 需內力性質 需內力性質
    data(2,38) = 1 1 4 0 0 -1 需內力 需內力
    data(2,39) = 1 1 4 0 0 -1 需攻擊力 需攻擊力
    data(2,40) = 1 1 4 0 0 -1 需輕功 需輕功
    data(2,41) = 1 1 4 0 0 -1 需用毒 需用毒
    data(2,42) = 1 1 4 0 0 -1 需醫療 需醫療
    data(2,43) = 1 1 4 0 0 -1 需解毒 需解毒
    data(2,44) = 1 1 4 0 0 -1 需拳掌功夫 需拳掌功夫
    data(2,45) = 1 1 4 0 0 -1 需御剑能力 需御剑能力
    data(2,46) = 1 1 4 0 0 -1 需兵器技巧 需兵器技巧
    data(2,47) = 1 1 4 0 0 -1 需指腿功夫 需指腿功夫
    data(2,48) = 1 1 4 0 0 -1 需暗毒技巧 需暗毒技巧
    data(2,49) = 1 1 4 0 0 -1 需資質 需資質
    data(2,50) = 1 1 4 0 0 -1 需經驗 需經驗
    data(2,51) = 1 1 4 0 0 -1 練出物品需經驗 練出物品需經驗
    data(2,52) = 1 1 4 0 0 2 需材料 需材料
    data(2,53) = 1 1 4 0 0 2 練出物品1 練出物品1
    data(2,54) = 1 1 4 0 0 2 練出物品2 練出物品2
    data(2,55) = 1 1 4 0 0 2 練出物品3 練出物品3
    data(2,56) = 1 1 4 0 0 2 練出物品4 練出物品4
    data(2,57) = 1 1 4 0 0 2 練出物品5 練出物品5
    data(2,58) = 1 1 4 0 0 -1 需要物品1數量 需要物品1數量
    data(2,59) = 1 1 4 0 0 -1 需要物品2數量 需要物品2數量
    data(2,60) = 1 1 4 0 0 -1 需要物品3數量 需要物品3數量
    data(2,61) = 1 1 4 0 0 -1 需要物品4數量 需要物品4數量
    data(2,62) = 1 1 4 0 0 -1 需要物品5數量 需要物品5數量
    data(2,63) = 1 1 4 0 0 -1 售價 售價
    data(2,64) = 1 1 4 0 0 -1 待定 待定
    data(2,65) = 1 1 4 0 0 -1 待定 待定
    data(2,66) = 1 1 4 0 0 -1 待定 待定
    data(2,67) = 1 1 4 0 0 -1 待定 待定
    data(2,68) = 1 1 4 0 0 -1 待定 待定
    data(2,69) = 1 1 4 0 0 -1 待定 待定
    data(2,70) = 1 1 4 0 0 -1 待定 待定
    data(2,71) = 1 1 4 0 0 -1 待定 待定
    data(2,72) = 1 1 4 0 0 -1 待定 待定
    data(2,73) = 1 1 4 0 0 -1 待定 待定
    data(2,74) = 1 1 4 0 0 -1 待定 待定



    TypeName3 =场景
    TypedataItem3 = 22
    
    data(3,0) = 1 1 4 0 0 -1 代号 代号，偏移0
    data(3,1) = 1 1 10 1 1 -1 名称 名称，偏移2
    data(3,2) = 1 1 4 0 0 -1 出门音乐 出门音乐，偏移12
    data(3,3) = 1 1 4 0 0 -1 进门音乐 进门音乐，偏移14
    data(3,4) = 1 1 4 0 0 3 跳转场景 跳转到其它场景，-1表示没有。从一个场景跳转到另一个场景时用。，偏移16
    data(3,5) = 1 1 4 0 0 -1 进入条件 进入条件，0开放，1关闭，2队伍中轻功大于70才能进入，偏移18
    data(3,6) = 1 1 4 0 0 -1 外景入口X1 外景入口X1，如果不在外景有入口则设为0，起始偏移20
    data(3,7) = 1 1 4 0 0 -1 外景入口Y1 外景入口Y2，如果不在外景有入口则设为0，起始偏移22
    data(3,8) = 1 1 4 0 0 -1 外景入口X2 外景入口X2，如果不在外景有入口则设为0，起始偏移20
    data(3,9) = 1 1 4 0 0 -1 外景入口Y2 外景入口Y2，如果不在外景有入口则设为0，起始偏移22
    data(3,10) = 1 1 4 0 0 -1 入口X 入口X，进入场景主角初始坐标，偏移28
    data(3,11) = 1 1 4 0 0 -1 入口Y 入口Y，进入场景主角初始坐标，偏移30
    data(3,12) = 1 1 4 0 0 -1 出口X1 出口X1，场景出口坐标，起始偏移32
    data(3,13) = 1 1 4 0 0 -1 出口X2 出口X2，场景出口坐标，起始偏移32
    data(3,14) = 1 1 4 0 0 -1 出口X3 出口X3，场景出口坐标，起始偏移32
    data(3,15) = 1 1 4 0 0 -1 出口Y1 出口Y1，场景出口坐标，起始偏移38
    data(3,16) = 1 1 4 0 0 -1 出口Y2 出口Y2，场景出口坐标，起始偏移38
    data(3,17) = 1 1 4 0 0 -1 出口Y3 出口Y3，场景出口坐标，起始偏移38
    data(3,18) = 1 1 4 0 0 -1 跳转口X1 跳转口X1，X1跳转到其它场景入口坐标，X2从其它场景回来的坐标，起始偏移44
    data(3,19) = 1 1 4 0 0 -1 跳转口Y1 跳转口Y2，Y1跳转到其它场景入口坐标，Y2从其它场景回来的坐标，起始偏移46
    data(3,20) = 1 1 4 0 0 -1 跳转口X2 跳转口X2，X1跳转到其它场景入口坐标，X2从其它场景回来的坐标，起始偏移44
    data(3,21) = 1 1 4 0 0 -1 跳转口Y2 跳转口Y2，Y1跳转到其它场景入口坐标，Y2从其它场景回来的坐标，起始偏移46
    

    TypeName4 =武功
    TypedataItem4 = 85
    
    data(4,0) = 1 1 4 0 0 -1 代号 代号
    data(4,1) = 1 1 10 1 1 -1 名称 名称
    data(4,2) = 1 1 4 0 0 -1 命中率 命中率
    data(4,3) = 1 1 4 0 0 -1 自伤比例 自伤比例
    data(4,4) = 1 1 4 0 0 -1 杀体力 杀体力
    data(4,5) = 1 1 4 0 0 -1 杀生命上限 杀生命上限
    data(4,6) = 1 1 4 0 0 -1 描述 描述
    data(4,7) = 1 1 4 0 0 -1 耗气 耗气
    data(4,8) = 1 1 4 0 0 -1 装备效果 装备效果
    data(4,9) = 1 1 4 0 0 -1 使用效果 使用效果
    data(4,10) = 1 1 4 0 0 -1 造成異常 造成異常
    data(4,11) = 1 1 4 0 0 -1 造成幾率 造成幾率
    data(4,12) = 1 1 4 0 0 -1 回合 回合
    data(4,13) = 1 1 4 0 0 -1 武器 武器
    data(4,14) = 1 1 4 0 0 -1 暴擊率 暴擊率
    data(4,15) = 1 1 4 0 0 -1 雙擊率 雙擊率
    data(4,16) = 1 1 4 0 0 -1 被觸發武功 被觸發武功
    data(4,17) = 1 1 4 0 0 -1 被觸發幾率 被觸發幾率
    data(4,18) = 1 1 4 0 0 -1 攻擊 攻擊
    data(4,19) = 1 1 4 0 0 -1 輕功 輕功
    data(4,20) = 1 1 4 0 0 -1 等級 等級
    data(4,21) = 1 1 4 0 0 -1 拳掌 拳掌
    data(4,22) = 1 1 4 0 0 -1 御劍 御劍
    data(4,23) = 1 1 4 0 0 -1 兵器 兵器
    data(4,24) = 1 1 4 0 0 -1 指腿 指腿
    data(4,25) = 1 1 4 0 0 -1 暗毒 暗毒
    data(4,26) = 1 1 4 0 0 -1 內功 內功
    data(4,27) = 1 1 4 0 0 -1 未知 未知
    data(4,28) = 1 1 4 0 0 -1 出招音效 出招音效
    data(4,29) = 1 1 4 0 0 -1 武功类型 1拳2剑3刀4特殊
    data(4,30) = 1 1 4 0 0 -1 武功动画&音效 武功动画&音效，eft中的动画，音效为e**.wav
    data(4,31) = 1 1 4 0 0 -1 伤害类型 0杀伤生命1杀伤内力
    data(4,32) = 1 1 4 0 0 -1 攻击范围 0点1线2十字3面
    data(4,33) = 1 1 4 0 0 -1 消耗内力点数 消耗内力点数
    data(4,34) = 1 1 4 0 0 -1 敌人中毒点数 敌人中毒点数
    data(4,35) = 1 1 4 0 0 -1 1级攻击力 1级攻击力
    data(4,36) = 1 1 4 0 0 -1 2级攻击力 2级攻击力
    data(4,37) = 1 1 4 0 0 -1 3级攻击力 3级攻击力
    data(4,38) = 1 1 4 0 0 -1 4级攻击力 4级攻击力
    data(4,39) = 1 1 4 0 0 -1 5级攻击力 5级攻击力
    data(4,40) = 1 1 4 0 0 -1 6级攻击力 6级攻击力
    data(4,41) = 1 1 4 0 0 -1 7级攻击力 7级攻击力
    data(4,42) = 1 1 4 0 0 -1 8级攻击力 8级攻击力
    data(4,43) = 1 1 4 0 0 -1 9级攻击力 9级攻击力
    data(4,44) = 1 1 4 0 0 -1 10级攻击力 10级攻击力
    data(4,45) = 1 1 4 0 0 -1 1级移动范围 1级移动范围
    data(4,46) = 1 1 4 0 0 -1 2级移动范围 2级移动范围
    data(4,47) = 1 1 4 0 0 -1 3级移动范围 3级移动范围
    data(4,48) = 1 1 4 0 0 -1 4级移动范围 4级移动范围
    data(4,49) = 1 1 4 0 0 -1 5级移动范围 5级移动范围
    data(4,50) = 1 1 4 0 0 -1 6级移动范围 6级移动范围
    data(4,51) = 1 1 4 0 0 -1 7级移动范围 7级移动范围
    data(4,52) = 1 1 4 0 0 -1 8级移动范围 8级移动范围
    data(4,53) = 1 1 4 0 0 -1 9级移动范围 9级移动范围
    data(4,54) = 1 1 4 0 0 -1 10级移动范围 10级移动范围
    data(4,55) = 1 1 4 0 0 -1 1级杀伤范围 1级杀伤范围
    data(4,56) = 1 1 4 0 0 -1 2级杀伤范围 2级杀伤范围
    data(4,57) = 1 1 4 0 0 -1 3级杀伤范围 3级杀伤范围
    data(4,58) = 1 1 4 0 0 -1 4级杀伤范围 4级杀伤范围
    data(4,59) = 1 1 4 0 0 -1 5级杀伤范围 5级杀伤范围
    data(4,60) = 1 1 4 0 0 -1 6级杀伤范围 6级杀伤范围
    data(4,61) = 1 1 4 0 0 -1 7级杀伤范围 7级杀伤范围
    data(4,62) = 1 1 4 0 0 -1 8级杀伤范围 8级杀伤范围
    data(4,63) = 1 1 4 0 0 -1 9级杀伤范围 9级杀伤范围
    data(4,64) = 1 1 4 0 0 -1 10级杀伤范围 10级杀伤范围
    data(4,65) = 1 1 4 0 0 -1 1级加内力 1级加内力
    data(4,66) = 1 1 4 0 0 -1 2级加内力 2级加内力
    data(4,67) = 1 1 4 0 0 -1 3级加内力 3级加内力
    data(4,68) = 1 1 4 0 0 -1 4级加内力 4级加内力
    data(4,69) = 1 1 4 0 0 -1 5级加内力 5级加内力
    data(4,70) = 1 1 4 0 0 -1 6级加内力 6级加内力
    data(4,71) = 1 1 4 0 0 -1 7级加内力 7级加内力
    data(4,72) = 1 1 4 0 0 -1 8级加内力 8级加内力
    data(4,73) = 1 1 4 0 0 -1 9级加内力 9级加内力
    data(4,74) = 1 1 4 0 0 -1 10级加内力 10级加内力
    data(4,75) = 1 1 4 0 0 -1 1级杀伤内力 1级杀伤内力
    data(4,76) = 1 1 4 0 0 -1 2级杀伤内力 2级杀伤内力
    data(4,77) = 1 1 4 0 0 -1 3级杀伤内力 3级杀伤内力
    data(4,78) = 1 1 4 0 0 -1 4级杀伤内力 4级杀伤内力
    data(4,79) = 1 1 4 0 0 -1 5级杀伤内力 5级杀伤内力
    data(4,80) = 1 1 4 0 0 -1 6级杀伤内力 6级杀伤内力
    data(4,81) = 1 1 4 0 0 -1 7级杀伤内力 7级杀伤内力
    data(4,82) = 1 1 4 0 0 -1 8级杀伤内力 8级杀伤内力
    data(4,83) = 1 1 4 0 0 -1 9级杀伤内力 9级杀伤内力
    data(4,84) = 1 1 4 0 0 -1 10级杀伤内力 10级杀伤内力

 
    TypeName5 =小宝商店
    TypedataItem5 = 15
    
    data(5,0) = 1 1 4 0 0 2 物品1 物品1，起始偏移0
    data(5,1) = 1 1 4 0 0 2 物品2 物品2，起始偏移0
    data(5,2) = 1 1 4 0 0 2 物品3 物品3，起始偏移0
    data(5,3) = 1 1 4 0 0 2 物品4 物品4，起始偏移0
    data(5,4) = 1 1 4 0 0 2 物品5 物品5，起始偏移0
    data(5,5) = 1 1 4 0 0 -1 物品1数量 物品1数量，起始偏移10
    data(5,6) = 1 1 4 0 0 -1 物品2数量 物品2数量，起始偏移10
    data(5,7) = 1 1 4 0 0 -1 物品3数量 物品3数量，起始偏移10
    data(5,8) = 1 1 4 0 0 -1 物品4数量 物品4数量，起始偏移10
    data(5,9) = 1 1 4 0 0 -1 物品5数量 物品5数量，起始偏移10
    data(5,10) = 1 1 4 0 0 -1 物品1价格 物品1价格，起始偏移20
    data(5,11) = 1 1 4 0 0 -1 物品2价格 物品2价格，起始偏移20
    data(5,12) = 1 1 4 0 0 -1 物品3价格 物品3价格，起始偏移20
    data(5,13) = 1 1 4 0 0 -1 物品4价格 物品4价格，起始偏移20
    data(5,14) = 1 1 4 0 0 -1 物品5价格 物品5价格，起始偏移20

    TypeName6 =底蕴表
    TypedataItem6 = 1501
    
    data(6,0) = 1 1 4 0 0 -1 人物編號 人物編號
    data(6,1) = 1 1 4 0 0 -1 1 1
    data(6,2) = 1 1 4 0 0 -1 2 2
    data(6,3) = 1 1 4 0 0 -1 3 3
    data(6,4) = 1 1 4 0 0 -1 4 4
    data(6,5) = 1 1 4 0 0 -1 5 5
    data(6,6) = 1 1 4 0 0 -1 6 6
    data(6,7) = 1 1 4 0 0 -1 7 7
    data(6,8) = 1 1 4 0 0 -1 8 8
    data(6,9) = 1 1 4 0 0 -1 9 9
    data(6,10) = 1 1 4 0 0 -1 10 10
    data(6,11) = 1 1 4 0 0 -1 11 11
    data(6,12) = 1 1 4 0 0 -1 12 12
    data(6,13) = 1 1 4 0 0 -1 13 13
    data(6,14) = 1 1 4 0 0 -1 14 14
    data(6,15) = 1 1 4 0 0 -1 15 15
    data(6,16) = 1 1 4 0 0 -1 16 16
    data(6,17) = 1 1 4 0 0 -1 17 17
    data(6,18) = 1 1 4 0 0 -1 18 18
    data(6,19) = 1 1 4 0 0 -1 19 19
    data(6,20) = 1 1 4 0 0 -1 20 20
    data(6,21) = 1 1 4 0 0 -1 21 21
    data(6,22) = 1 1 4 0 0 -1 22 22
    data(6,23) = 1 1 4 0 0 -1 23 23
    data(6,24) = 1 1 4 0 0 -1 24 24
    data(6,25) = 1 1 4 0 0 -1 25 25
    data(6,26) = 1 1 4 0 0 -1 26 26
    data(6,27) = 1 1 4 0 0 -1 27 27
    data(6,28) = 1 1 4 0 0 -1 28 28
    data(6,29) = 1 1 4 0 0 -1 29 29
    data(6,30) = 1 1 4 0 0 -1 30 30
    data(6,31) = 1 1 4 0 0 -1 31 31
    data(6,32) = 1 1 4 0 0 -1 32 32
    data(6,33) = 1 1 4 0 0 -1 33 33
    data(6,34) = 1 1 4 0 0 -1 34 34
    data(6,35) = 1 1 4 0 0 -1 35 35
    data(6,36) = 1 1 4 0 0 -1 36 36
    data(6,37) = 1 1 4 0 0 -1 37 37
    data(6,38) = 1 1 4 0 0 -1 38 38
    data(6,39) = 1 1 4 0 0 -1 39 39
    data(6,40) = 1 1 4 0 0 -1 40 40
    data(6,41) = 1 1 4 0 0 -1 41 41
    data(6,42) = 1 1 4 0 0 -1 42 42
    data(6,43) = 1 1 4 0 0 -1 43 43
    data(6,44) = 1 1 4 0 0 -1 44 44
    data(6,45) = 1 1 4 0 0 -1 45 45
    data(6,46) = 1 1 4 0 0 -1 46 46
    data(6,47) = 1 1 4 0 0 -1 47 47
    data(6,48) = 1 1 4 0 0 -1 48 48
    data(6,49) = 1 1 4 0 0 -1 49 49
    data(6,50) = 1 1 4 0 0 -1 50 50
    data(6,51) = 1 1 4 0 0 -1 51 51
    data(6,52) = 1 1 4 0 0 -1 52 52
    data(6,53) = 1 1 4 0 0 -1 53 53
    data(6,54) = 1 1 4 0 0 -1 54 54
    data(6,55) = 1 1 4 0 0 -1 55 55
    data(6,56) = 1 1 4 0 0 -1 56 56
    data(6,57) = 1 1 4 0 0 -1 57 57
    data(6,58) = 1 1 4 0 0 -1 58 58
    data(6,59) = 1 1 4 0 0 -1 59 59
    data(6,60) = 1 1 4 0 0 -1 60 60
    data(6,61) = 1 1 4 0 0 -1 61 61
    data(6,62) = 1 1 4 0 0 -1 62 62
    data(6,63) = 1 1 4 0 0 -1 63 63
    data(6,64) = 1 1 4 0 0 -1 64 64
    data(6,65) = 1 1 4 0 0 -1 65 65
    data(6,66) = 1 1 4 0 0 -1 66 66
    data(6,67) = 1 1 4 0 0 -1 67 67
    data(6,68) = 1 1 4 0 0 -1 68 68
    data(6,69) = 1 1 4 0 0 -1 69 69
    data(6,70) = 1 1 4 0 0 -1 70 70
    data(6,71) = 1 1 4 0 0 -1 71 71
    data(6,72) = 1 1 4 0 0 -1 72 72
    data(6,73) = 1 1 4 0 0 -1 73 73
    data(6,74) = 1 1 4 0 0 -1 74 74
    data(6,75) = 1 1 4 0 0 -1 75 75
    data(6,76) = 1 1 4 0 0 -1 76 76
    data(6,77) = 1 1 4 0 0 -1 77 77
    data(6,78) = 1 1 4 0 0 -1 78 78
    data(6,79) = 1 1 4 0 0 -1 79 79
    data(6,80) = 1 1 4 0 0 -1 80 80
    data(6,81) = 1 1 4 0 0 -1 81 81
    data(6,82) = 1 1 4 0 0 -1 82 82
    data(6,83) = 1 1 4 0 0 -1 83 83
    data(6,84) = 1 1 4 0 0 -1 84 84
    data(6,85) = 1 1 4 0 0 -1 85 85
    data(6,86) = 1 1 4 0 0 -1 86 86
    data(6,87) = 1 1 4 0 0 -1 87 87
    data(6,88) = 1 1 4 0 0 -1 88 88
    data(6,89) = 1 1 4 0 0 -1 89 89
    data(6,90) = 1 1 4 0 0 -1 90 90
    data(6,91) = 1 1 4 0 0 -1 91 91
    data(6,92) = 1 1 4 0 0 -1 92 92
    data(6,93) = 1 1 4 0 0 -1 93 93
    data(6,94) = 1 1 4 0 0 -1 94 94
    data(6,95) = 1 1 4 0 0 -1 95 95
    data(6,96) = 1 1 4 0 0 -1 96 96
    data(6,97) = 1 1 4 0 0 -1 97 97
    data(6,98) = 1 1 4 0 0 -1 98 98
    data(6,99) = 1 1 4 0 0 -1 99 99
    data(6,100) = 1 1 4 0 0 -1 100 100
    data(6,101) = 1 1 4 0 0 -1 101 101
    data(6,102) = 1 1 4 0 0 -1 102 102
    data(6,103) = 1 1 4 0 0 -1 103 103
    data(6,104) = 1 1 4 0 0 -1 104 104
    data(6,105) = 1 1 4 0 0 -1 105 105
    data(6,106) = 1 1 4 0 0 -1 106 106
    data(6,107) = 1 1 4 0 0 -1 107 107
    data(6,108) = 1 1 4 0 0 -1 108 108
    data(6,109) = 1 1 4 0 0 -1 109 109
    data(6,110) = 1 1 4 0 0 -1 110 110
    data(6,111) = 1 1 4 0 0 -1 111 111
    data(6,112) = 1 1 4 0 0 -1 112 112
    data(6,113) = 1 1 4 0 0 -1 113 113
    data(6,114) = 1 1 4 0 0 -1 114 114
    data(6,115) = 1 1 4 0 0 -1 115 115
    data(6,116) = 1 1 4 0 0 -1 116 116
    data(6,117) = 1 1 4 0 0 -1 117 117
    data(6,118) = 1 1 4 0 0 -1 118 118
    data(6,119) = 1 1 4 0 0 -1 119 119
    data(6,120) = 1 1 4 0 0 -1 120 120
    data(6,121) = 1 1 4 0 0 -1 121 121
    data(6,122) = 1 1 4 0 0 -1 122 122
    data(6,123) = 1 1 4 0 0 -1 123 123
    data(6,124) = 1 1 4 0 0 -1 124 124
    data(6,125) = 1 1 4 0 0 -1 125 125
    data(6,126) = 1 1 4 0 0 -1 126 126
    data(6,127) = 1 1 4 0 0 -1 127 127
    data(6,128) = 1 1 4 0 0 -1 128 128
    data(6,129) = 1 1 4 0 0 -1 129 129
    data(6,130) = 1 1 4 0 0 -1 130 130
    data(6,131) = 1 1 4 0 0 -1 131 131
    data(6,132) = 1 1 4 0 0 -1 132 132
    data(6,133) = 1 1 4 0 0 -1 133 133
    data(6,134) = 1 1 4 0 0 -1 134 134
    data(6,135) = 1 1 4 0 0 -1 135 135
    data(6,136) = 1 1 4 0 0 -1 136 136
    data(6,137) = 1 1 4 0 0 -1 137 137
    data(6,138) = 1 1 4 0 0 -1 138 138
    data(6,139) = 1 1 4 0 0 -1 139 139
    data(6,140) = 1 1 4 0 0 -1 140 140
    data(6,141) = 1 1 4 0 0 -1 141 141
    data(6,142) = 1 1 4 0 0 -1 142 142
    data(6,143) = 1 1 4 0 0 -1 143 143
    data(6,144) = 1 1 4 0 0 -1 144 144
    data(6,145) = 1 1 4 0 0 -1 145 145
    data(6,146) = 1 1 4 0 0 -1 146 146
    data(6,147) = 1 1 4 0 0 -1 147 147
    data(6,148) = 1 1 4 0 0 -1 148 148
    data(6,149) = 1 1 4 0 0 -1 149 149
    data(6,150) = 1 1 4 0 0 -1 150 150
    data(6,151) = 1 1 4 0 0 -1 151 151
    data(6,152) = 1 1 4 0 0 -1 152 152
    data(6,153) = 1 1 4 0 0 -1 153 153
    data(6,154) = 1 1 4 0 0 -1 154 154
    data(6,155) = 1 1 4 0 0 -1 155 155
    data(6,156) = 1 1 4 0 0 -1 156 156
    data(6,157) = 1 1 4 0 0 -1 157 157
    data(6,158) = 1 1 4 0 0 -1 158 158
    data(6,159) = 1 1 4 0 0 -1 159 159
    data(6,160) = 1 1 4 0 0 -1 160 160
    data(6,161) = 1 1 4 0 0 -1 161 161
    data(6,162) = 1 1 4 0 0 -1 162 162
    data(6,163) = 1 1 4 0 0 -1 163 163
    data(6,164) = 1 1 4 0 0 -1 164 164
    data(6,165) = 1 1 4 0 0 -1 165 165
    data(6,166) = 1 1 4 0 0 -1 166 166
    data(6,167) = 1 1 4 0 0 -1 167 167
    data(6,168) = 1 1 4 0 0 -1 168 168
    data(6,169) = 1 1 4 0 0 -1 169 169
    data(6,170) = 1 1 4 0 0 -1 170 170
    data(6,171) = 1 1 4 0 0 -1 171 171
    data(6,172) = 1 1 4 0 0 -1 172 172
    data(6,173) = 1 1 4 0 0 -1 173 173
    data(6,174) = 1 1 4 0 0 -1 174 174
    data(6,175) = 1 1 4 0 0 -1 175 175
    data(6,176) = 1 1 4 0 0 -1 176 176
    data(6,177) = 1 1 4 0 0 -1 177 177
    data(6,178) = 1 1 4 0 0 -1 178 178
    data(6,179) = 1 1 4 0 0 -1 179 179
    data(6,180) = 1 1 4 0 0 -1 180 180
    data(6,181) = 1 1 4 0 0 -1 181 181
    data(6,182) = 1 1 4 0 0 -1 182 182
    data(6,183) = 1 1 4 0 0 -1 183 183
    data(6,184) = 1 1 4 0 0 -1 184 184
    data(6,185) = 1 1 4 0 0 -1 185 185
    data(6,186) = 1 1 4 0 0 -1 186 186
    data(6,187) = 1 1 4 0 0 -1 187 187
    data(6,188) = 1 1 4 0 0 -1 188 188
    data(6,189) = 1 1 4 0 0 -1 189 189
    data(6,190) = 1 1 4 0 0 -1 190 190
    data(6,191) = 1 1 4 0 0 -1 191 191
    data(6,192) = 1 1 4 0 0 -1 192 192
    data(6,193) = 1 1 4 0 0 -1 193 193
    data(6,194) = 1 1 4 0 0 -1 194 194
    data(6,195) = 1 1 4 0 0 -1 195 195
    data(6,196) = 1 1 4 0 0 -1 196 196
    data(6,197) = 1 1 4 0 0 -1 197 197
    data(6,198) = 1 1 4 0 0 -1 198 198
    data(6,199) = 1 1 4 0 0 -1 199 199
    data(6,200) = 1 1 4 0 0 -1 200 200
    data(6,201) = 1 1 4 0 0 -1 201 201
    data(6,202) = 1 1 4 0 0 -1 202 202
    data(6,203) = 1 1 4 0 0 -1 203 203
    data(6,204) = 1 1 4 0 0 -1 204 204
    data(6,205) = 1 1 4 0 0 -1 205 205
    data(6,206) = 1 1 4 0 0 -1 206 206
    data(6,207) = 1 1 4 0 0 -1 207 207
    data(6,208) = 1 1 4 0 0 -1 208 208
    data(6,209) = 1 1 4 0 0 -1 209 209
    data(6,210) = 1 1 4 0 0 -1 210 210
    data(6,211) = 1 1 4 0 0 -1 211 211
    data(6,212) = 1 1 4 0 0 -1 212 212
    data(6,213) = 1 1 4 0 0 -1 213 213
    data(6,214) = 1 1 4 0 0 -1 214 214
    data(6,215) = 1 1 4 0 0 -1 215 215
    data(6,216) = 1 1 4 0 0 -1 216 216
    data(6,217) = 1 1 4 0 0 -1 217 217
    data(6,218) = 1 1 4 0 0 -1 218 218
    data(6,219) = 1 1 4 0 0 -1 219 219
    data(6,220) = 1 1 4 0 0 -1 220 220
    data(6,221) = 1 1 4 0 0 -1 221 221
    data(6,222) = 1 1 4 0 0 -1 222 222
    data(6,223) = 1 1 4 0 0 -1 223 223
    data(6,224) = 1 1 4 0 0 -1 224 224
    data(6,225) = 1 1 4 0 0 -1 225 225
    data(6,226) = 1 1 4 0 0 -1 226 226
    data(6,227) = 1 1 4 0 0 -1 227 227
    data(6,228) = 1 1 4 0 0 -1 228 228
    data(6,229) = 1 1 4 0 0 -1 229 229
    data(6,230) = 1 1 4 0 0 -1 230 230
    data(6,231) = 1 1 4 0 0 -1 231 231
    data(6,232) = 1 1 4 0 0 -1 232 232
    data(6,233) = 1 1 4 0 0 -1 233 233
    data(6,234) = 1 1 4 0 0 -1 234 234
    data(6,235) = 1 1 4 0 0 -1 235 235
    data(6,236) = 1 1 4 0 0 -1 236 236
    data(6,237) = 1 1 4 0 0 -1 237 237
    data(6,238) = 1 1 4 0 0 -1 238 238
    data(6,239) = 1 1 4 0 0 -1 239 239
    data(6,240) = 1 1 4 0 0 -1 240 240
    data(6,241) = 1 1 4 0 0 -1 241 241
    data(6,242) = 1 1 4 0 0 -1 242 242
    data(6,243) = 1 1 4 0 0 -1 243 243
    data(6,244) = 1 1 4 0 0 -1 244 244
    data(6,245) = 1 1 4 0 0 -1 245 245
    data(6,246) = 1 1 4 0 0 -1 246 246
    data(6,247) = 1 1 4 0 0 -1 247 247
    data(6,248) = 1 1 4 0 0 -1 248 248
    data(6,249) = 1 1 4 0 0 -1 249 249
    data(6,250) = 1 1 4 0 0 -1 250 250
    data(6,251) = 1 1 4 0 0 -1 251 251
    data(6,252) = 1 1 4 0 0 -1 252 252
    data(6,253) = 1 1 4 0 0 -1 253 253
    data(6,254) = 1 1 4 0 0 -1 254 254
    data(6,255) = 1 1 4 0 0 -1 255 255
    data(6,256) = 1 1 4 0 0 -1 256 256
    data(6,257) = 1 1 4 0 0 -1 257 257
    data(6,258) = 1 1 4 0 0 -1 258 258
    data(6,259) = 1 1 4 0 0 -1 259 259
    data(6,260) = 1 1 4 0 0 -1 260 260
    data(6,261) = 1 1 4 0 0 -1 261 261
    data(6,262) = 1 1 4 0 0 -1 262 262
    data(6,263) = 1 1 4 0 0 -1 263 263
    data(6,264) = 1 1 4 0 0 -1 264 264
    data(6,265) = 1 1 4 0 0 -1 265 265
    data(6,266) = 1 1 4 0 0 -1 266 266
    data(6,267) = 1 1 4 0 0 -1 267 267
    data(6,268) = 1 1 4 0 0 -1 268 268
    data(6,269) = 1 1 4 0 0 -1 269 269
    data(6,270) = 1 1 4 0 0 -1 270 270
    data(6,271) = 1 1 4 0 0 -1 271 271
    data(6,272) = 1 1 4 0 0 -1 272 272
    data(6,273) = 1 1 4 0 0 -1 273 273
    data(6,274) = 1 1 4 0 0 -1 274 274
    data(6,275) = 1 1 4 0 0 -1 275 275
    data(6,276) = 1 1 4 0 0 -1 276 276
    data(6,277) = 1 1 4 0 0 -1 277 277
    data(6,278) = 1 1 4 0 0 -1 278 278
    data(6,279) = 1 1 4 0 0 -1 279 279
    data(6,280) = 1 1 4 0 0 -1 280 280
    data(6,281) = 1 1 4 0 0 -1 281 281
    data(6,282) = 1 1 4 0 0 -1 282 282
    data(6,283) = 1 1 4 0 0 -1 283 283
    data(6,284) = 1 1 4 0 0 -1 284 284
    data(6,285) = 1 1 4 0 0 -1 285 285
    data(6,286) = 1 1 4 0 0 -1 286 286
    data(6,287) = 1 1 4 0 0 -1 287 287
    data(6,288) = 1 1 4 0 0 -1 288 288
    data(6,289) = 1 1 4 0 0 -1 289 289
    data(6,290) = 1 1 4 0 0 -1 290 290
    data(6,291) = 1 1 4 0 0 -1 291 291
    data(6,292) = 1 1 4 0 0 -1 292 292
    data(6,293) = 1 1 4 0 0 -1 293 293
    data(6,294) = 1 1 4 0 0 -1 294 294
    data(6,295) = 1 1 4 0 0 -1 295 295
    data(6,296) = 1 1 4 0 0 -1 296 296
    data(6,297) = 1 1 4 0 0 -1 297 297
    data(6,298) = 1 1 4 0 0 -1 298 298
    data(6,299) = 1 1 4 0 0 -1 299 299
    data(6,300) = 1 1 4 0 0 -1 300 300
    data(6,301) = 1 1 4 0 0 -1 301 301
    data(6,302) = 1 1 4 0 0 -1 302 302
    data(6,303) = 1 1 4 0 0 -1 303 303
    data(6,304) = 1 1 4 0 0 -1 304 304
    data(6,305) = 1 1 4 0 0 -1 305 305
    data(6,306) = 1 1 4 0 0 -1 306 306
    data(6,307) = 1 1 4 0 0 -1 307 307
    data(6,308) = 1 1 4 0 0 -1 308 308
    data(6,309) = 1 1 4 0 0 -1 309 309
    data(6,310) = 1 1 4 0 0 -1 310 310
    data(6,311) = 1 1 4 0 0 -1 311 311
    data(6,312) = 1 1 4 0 0 -1 312 312
    data(6,313) = 1 1 4 0 0 -1 313 313
    data(6,314) = 1 1 4 0 0 -1 314 314
    data(6,315) = 1 1 4 0 0 -1 315 315
    data(6,316) = 1 1 4 0 0 -1 316 316
    data(6,317) = 1 1 4 0 0 -1 317 317
    data(6,318) = 1 1 4 0 0 -1 318 318
    data(6,319) = 1 1 4 0 0 -1 319 319
    data(6,320) = 1 1 4 0 0 -1 320 320
    data(6,321) = 1 1 4 0 0 -1 321 321
    data(6,322) = 1 1 4 0 0 -1 322 322
    data(6,323) = 1 1 4 0 0 -1 323 323
    data(6,324) = 1 1 4 0 0 -1 324 324
    data(6,325) = 1 1 4 0 0 -1 325 325
    data(6,326) = 1 1 4 0 0 -1 326 326
    data(6,327) = 1 1 4 0 0 -1 327 327
    data(6,328) = 1 1 4 0 0 -1 328 328
    data(6,329) = 1 1 4 0 0 -1 329 329
    data(6,330) = 1 1 4 0 0 -1 330 330
    data(6,331) = 1 1 4 0 0 -1 331 331
    data(6,332) = 1 1 4 0 0 -1 332 332
    data(6,333) = 1 1 4 0 0 -1 333 333
    data(6,334) = 1 1 4 0 0 -1 334 334
    data(6,335) = 1 1 4 0 0 -1 335 335
    data(6,336) = 1 1 4 0 0 -1 336 336
    data(6,337) = 1 1 4 0 0 -1 337 337
    data(6,338) = 1 1 4 0 0 -1 338 338
    data(6,339) = 1 1 4 0 0 -1 339 339
    data(6,340) = 1 1 4 0 0 -1 340 340
    data(6,341) = 1 1 4 0 0 -1 341 341
    data(6,342) = 1 1 4 0 0 -1 342 342
    data(6,343) = 1 1 4 0 0 -1 343 343
    data(6,344) = 1 1 4 0 0 -1 344 344
    data(6,345) = 1 1 4 0 0 -1 345 345
    data(6,346) = 1 1 4 0 0 -1 346 346
    data(6,347) = 1 1 4 0 0 -1 347 347
    data(6,348) = 1 1 4 0 0 -1 348 348
    data(6,349) = 1 1 4 0 0 -1 349 349
    data(6,350) = 1 1 4 0 0 -1 350 350
    data(6,351) = 1 1 4 0 0 -1 351 351
    data(6,352) = 1 1 4 0 0 -1 352 352
    data(6,353) = 1 1 4 0 0 -1 353 353
    data(6,354) = 1 1 4 0 0 -1 354 354
    data(6,355) = 1 1 4 0 0 -1 355 355
    data(6,356) = 1 1 4 0 0 -1 356 356
    data(6,357) = 1 1 4 0 0 -1 357 357
    data(6,358) = 1 1 4 0 0 -1 358 358
    data(6,359) = 1 1 4 0 0 -1 359 359
    data(6,360) = 1 1 4 0 0 -1 360 360
    data(6,361) = 1 1 4 0 0 -1 361 361
    data(6,362) = 1 1 4 0 0 -1 362 362
    data(6,363) = 1 1 4 0 0 -1 363 363
    data(6,364) = 1 1 4 0 0 -1 364 364
    data(6,365) = 1 1 4 0 0 -1 365 365
    data(6,366) = 1 1 4 0 0 -1 366 366
    data(6,367) = 1 1 4 0 0 -1 367 367
    data(6,368) = 1 1 4 0 0 -1 368 368
    data(6,369) = 1 1 4 0 0 -1 369 369
    data(6,370) = 1 1 4 0 0 -1 370 370
    data(6,371) = 1 1 4 0 0 -1 371 371
    data(6,372) = 1 1 4 0 0 -1 372 372
    data(6,373) = 1 1 4 0 0 -1 373 373
    data(6,374) = 1 1 4 0 0 -1 374 374
    data(6,375) = 1 1 4 0 0 -1 375 375
    data(6,376) = 1 1 4 0 0 -1 376 376
    data(6,377) = 1 1 4 0 0 -1 377 377
    data(6,378) = 1 1 4 0 0 -1 378 378
    data(6,379) = 1 1 4 0 0 -1 379 379
    data(6,380) = 1 1 4 0 0 -1 380 380
    data(6,381) = 1 1 4 0 0 -1 381 381
    data(6,382) = 1 1 4 0 0 -1 382 382
    data(6,383) = 1 1 4 0 0 -1 383 383
    data(6,384) = 1 1 4 0 0 -1 384 384
    data(6,385) = 1 1 4 0 0 -1 385 385
    data(6,386) = 1 1 4 0 0 -1 386 386
    data(6,387) = 1 1 4 0 0 -1 387 387
    data(6,388) = 1 1 4 0 0 -1 388 388
    data(6,389) = 1 1 4 0 0 -1 389 389
    data(6,390) = 1 1 4 0 0 -1 390 390
    data(6,391) = 1 1 4 0 0 -1 391 391
    data(6,392) = 1 1 4 0 0 -1 392 392
    data(6,393) = 1 1 4 0 0 -1 393 393
    data(6,394) = 1 1 4 0 0 -1 394 394
    data(6,395) = 1 1 4 0 0 -1 395 395
    data(6,396) = 1 1 4 0 0 -1 396 396
    data(6,397) = 1 1 4 0 0 -1 397 397
    data(6,398) = 1 1 4 0 0 -1 398 398
    data(6,399) = 1 1 4 0 0 -1 399 399
    data(6,400) = 1 1 4 0 0 -1 400 400
    data(6,401) = 1 1 4 0 0 -1 401 401
    data(6,402) = 1 1 4 0 0 -1 402 402
    data(6,403) = 1 1 4 0 0 -1 403 403
    data(6,404) = 1 1 4 0 0 -1 404 404
    data(6,405) = 1 1 4 0 0 -1 405 405
    data(6,406) = 1 1 4 0 0 -1 406 406
    data(6,407) = 1 1 4 0 0 -1 407 407
    data(6,408) = 1 1 4 0 0 -1 408 408
    data(6,409) = 1 1 4 0 0 -1 409 409
    data(6,410) = 1 1 4 0 0 -1 410 410
    data(6,411) = 1 1 4 0 0 -1 411 411
    data(6,412) = 1 1 4 0 0 -1 412 412
    data(6,413) = 1 1 4 0 0 -1 413 413
    data(6,414) = 1 1 4 0 0 -1 414 414
    data(6,415) = 1 1 4 0 0 -1 415 415
    data(6,416) = 1 1 4 0 0 -1 416 416
    data(6,417) = 1 1 4 0 0 -1 417 417
    data(6,418) = 1 1 4 0 0 -1 418 418
    data(6,419) = 1 1 4 0 0 -1 419 419
    data(6,420) = 1 1 4 0 0 -1 420 420
    data(6,421) = 1 1 4 0 0 -1 421 421
    data(6,422) = 1 1 4 0 0 -1 422 422
    data(6,423) = 1 1 4 0 0 -1 423 423
    data(6,424) = 1 1 4 0 0 -1 424 424
    data(6,425) = 1 1 4 0 0 -1 425 425
    data(6,426) = 1 1 4 0 0 -1 426 426
    data(6,427) = 1 1 4 0 0 -1 427 427
    data(6,428) = 1 1 4 0 0 -1 428 428
    data(6,429) = 1 1 4 0 0 -1 429 429
    data(6,430) = 1 1 4 0 0 -1 430 430
    data(6,431) = 1 1 4 0 0 -1 431 431
    data(6,432) = 1 1 4 0 0 -1 432 432
    data(6,433) = 1 1 4 0 0 -1 433 433
    data(6,434) = 1 1 4 0 0 -1 434 434
    data(6,435) = 1 1 4 0 0 -1 435 435
    data(6,436) = 1 1 4 0 0 -1 436 436
    data(6,437) = 1 1 4 0 0 -1 437 437
    data(6,438) = 1 1 4 0 0 -1 438 438
    data(6,439) = 1 1 4 0 0 -1 439 439
    data(6,440) = 1 1 4 0 0 -1 440 440
    data(6,441) = 1 1 4 0 0 -1 441 441
    data(6,442) = 1 1 4 0 0 -1 442 442
    data(6,443) = 1 1 4 0 0 -1 443 443
    data(6,444) = 1 1 4 0 0 -1 444 444
    data(6,445) = 1 1 4 0 0 -1 445 445
    data(6,446) = 1 1 4 0 0 -1 446 446
    data(6,447) = 1 1 4 0 0 -1 447 447
    data(6,448) = 1 1 4 0 0 -1 448 448
    data(6,449) = 1 1 4 0 0 -1 449 449
    data(6,450) = 1 1 4 0 0 -1 450 450
    data(6,451) = 1 1 4 0 0 -1 451 451
    data(6,452) = 1 1 4 0 0 -1 452 452
    data(6,453) = 1 1 4 0 0 -1 453 453
    data(6,454) = 1 1 4 0 0 -1 454 454
    data(6,455) = 1 1 4 0 0 -1 455 455
    data(6,456) = 1 1 4 0 0 -1 456 456
    data(6,457) = 1 1 4 0 0 -1 457 457
    data(6,458) = 1 1 4 0 0 -1 458 458
    data(6,459) = 1 1 4 0 0 -1 459 459
    data(6,460) = 1 1 4 0 0 -1 460 460
    data(6,461) = 1 1 4 0 0 -1 461 461
    data(6,462) = 1 1 4 0 0 -1 462 462
    data(6,463) = 1 1 4 0 0 -1 463 463
    data(6,464) = 1 1 4 0 0 -1 464 464
    data(6,465) = 1 1 4 0 0 -1 465 465
    data(6,466) = 1 1 4 0 0 -1 466 466
    data(6,467) = 1 1 4 0 0 -1 467 467
    data(6,468) = 1 1 4 0 0 -1 468 468
    data(6,469) = 1 1 4 0 0 -1 469 469
    data(6,470) = 1 1 4 0 0 -1 470 470
    data(6,471) = 1 1 4 0 0 -1 471 471
    data(6,472) = 1 1 4 0 0 -1 472 472
    data(6,473) = 1 1 4 0 0 -1 473 473
    data(6,474) = 1 1 4 0 0 -1 474 474
    data(6,475) = 1 1 4 0 0 -1 475 475
    data(6,476) = 1 1 4 0 0 -1 476 476
    data(6,477) = 1 1 4 0 0 -1 477 477
    data(6,478) = 1 1 4 0 0 -1 478 478
    data(6,479) = 1 1 4 0 0 -1 479 479
    data(6,480) = 1 1 4 0 0 -1 480 480
    data(6,481) = 1 1 4 0 0 -1 481 481
    data(6,482) = 1 1 4 0 0 -1 482 482
    data(6,483) = 1 1 4 0 0 -1 483 483
    data(6,484) = 1 1 4 0 0 -1 484 484
    data(6,485) = 1 1 4 0 0 -1 485 485
    data(6,486) = 1 1 4 0 0 -1 486 486
    data(6,487) = 1 1 4 0 0 -1 487 487
    data(6,488) = 1 1 4 0 0 -1 488 488
    data(6,489) = 1 1 4 0 0 -1 489 489
    data(6,490) = 1 1 4 0 0 -1 490 490
    data(6,491) = 1 1 4 0 0 -1 491 491
    data(6,492) = 1 1 4 0 0 -1 492 492
    data(6,493) = 1 1 4 0 0 -1 493 493
    data(6,494) = 1 1 4 0 0 -1 494 494
    data(6,495) = 1 1 4 0 0 -1 495 495
    data(6,496) = 1 1 4 0 0 -1 496 496
    data(6,497) = 1 1 4 0 0 -1 497 497
    data(6,498) = 1 1 4 0 0 -1 498 498
    data(6,499) = 1 1 4 0 0 -1 499 499
    data(6,500) = 1 1 4 0 0 -1 500 500
    data(6,501) = 1 1 4 0 0 -1 501 501
    data(6,502) = 1 1 4 0 0 -1 502 502
    data(6,503) = 1 1 4 0 0 -1 503 503
    data(6,504) = 1 1 4 0 0 -1 504 504
    data(6,505) = 1 1 4 0 0 -1 505 505
    data(6,506) = 1 1 4 0 0 -1 506 506
    data(6,507) = 1 1 4 0 0 -1 507 507
    data(6,508) = 1 1 4 0 0 -1 508 508
    data(6,509) = 1 1 4 0 0 -1 509 509
    data(6,510) = 1 1 4 0 0 -1 510 510
    data(6,511) = 1 1 4 0 0 -1 511 511
    data(6,512) = 1 1 4 0 0 -1 512 512
    data(6,513) = 1 1 4 0 0 -1 513 513
    data(6,514) = 1 1 4 0 0 -1 514 514
    data(6,515) = 1 1 4 0 0 -1 515 515
    data(6,516) = 1 1 4 0 0 -1 516 516
    data(6,517) = 1 1 4 0 0 -1 517 517
    data(6,518) = 1 1 4 0 0 -1 518 518
    data(6,519) = 1 1 4 0 0 -1 519 519
    data(6,520) = 1 1 4 0 0 -1 520 520
    data(6,521) = 1 1 4 0 0 -1 521 521
    data(6,522) = 1 1 4 0 0 -1 522 522
    data(6,523) = 1 1 4 0 0 -1 523 523
    data(6,524) = 1 1 4 0 0 -1 524 524
    data(6,525) = 1 1 4 0 0 -1 525 525
    data(6,526) = 1 1 4 0 0 -1 526 526
    data(6,527) = 1 1 4 0 0 -1 527 527
    data(6,528) = 1 1 4 0 0 -1 528 528
    data(6,529) = 1 1 4 0 0 -1 529 529
    data(6,530) = 1 1 4 0 0 -1 530 530
    data(6,531) = 1 1 4 0 0 -1 531 531
    data(6,532) = 1 1 4 0 0 -1 532 532
    data(6,533) = 1 1 4 0 0 -1 533 533
    data(6,534) = 1 1 4 0 0 -1 534 534
    data(6,535) = 1 1 4 0 0 -1 535 535
    data(6,536) = 1 1 4 0 0 -1 536 536
    data(6,537) = 1 1 4 0 0 -1 537 537
    data(6,538) = 1 1 4 0 0 -1 538 538
    data(6,539) = 1 1 4 0 0 -1 539 539
    data(6,540) = 1 1 4 0 0 -1 540 540
    data(6,541) = 1 1 4 0 0 -1 541 541
    data(6,542) = 1 1 4 0 0 -1 542 542
    data(6,543) = 1 1 4 0 0 -1 543 543
    data(6,544) = 1 1 4 0 0 -1 544 544
    data(6,545) = 1 1 4 0 0 -1 545 545
    data(6,546) = 1 1 4 0 0 -1 546 546
    data(6,547) = 1 1 4 0 0 -1 547 547
    data(6,548) = 1 1 4 0 0 -1 548 548
    data(6,549) = 1 1 4 0 0 -1 549 549
    data(6,550) = 1 1 4 0 0 -1 550 550
    data(6,551) = 1 1 4 0 0 -1 551 551
    data(6,552) = 1 1 4 0 0 -1 552 552
    data(6,553) = 1 1 4 0 0 -1 553 553
    data(6,554) = 1 1 4 0 0 -1 554 554
    data(6,555) = 1 1 4 0 0 -1 555 555
    data(6,556) = 1 1 4 0 0 -1 556 556
    data(6,557) = 1 1 4 0 0 -1 557 557
    data(6,558) = 1 1 4 0 0 -1 558 558
    data(6,559) = 1 1 4 0 0 -1 559 559
    data(6,560) = 1 1 4 0 0 -1 560 560
    data(6,561) = 1 1 4 0 0 -1 561 561
    data(6,562) = 1 1 4 0 0 -1 562 562
    data(6,563) = 1 1 4 0 0 -1 563 563
    data(6,564) = 1 1 4 0 0 -1 564 564
    data(6,565) = 1 1 4 0 0 -1 565 565
    data(6,566) = 1 1 4 0 0 -1 566 566
    data(6,567) = 1 1 4 0 0 -1 567 567
    data(6,568) = 1 1 4 0 0 -1 568 568
    data(6,569) = 1 1 4 0 0 -1 569 569
    data(6,570) = 1 1 4 0 0 -1 570 570
    data(6,571) = 1 1 4 0 0 -1 571 571
    data(6,572) = 1 1 4 0 0 -1 572 572
    data(6,573) = 1 1 4 0 0 -1 573 573
    data(6,574) = 1 1 4 0 0 -1 574 574
    data(6,575) = 1 1 4 0 0 -1 575 575
    data(6,576) = 1 1 4 0 0 -1 576 576
    data(6,577) = 1 1 4 0 0 -1 577 577
    data(6,578) = 1 1 4 0 0 -1 578 578
    data(6,579) = 1 1 4 0 0 -1 579 579
    data(6,580) = 1 1 4 0 0 -1 580 580
    data(6,581) = 1 1 4 0 0 -1 581 581
    data(6,582) = 1 1 4 0 0 -1 582 582
    data(6,583) = 1 1 4 0 0 -1 583 583
    data(6,584) = 1 1 4 0 0 -1 584 584
    data(6,585) = 1 1 4 0 0 -1 585 585
    data(6,586) = 1 1 4 0 0 -1 586 586
    data(6,587) = 1 1 4 0 0 -1 587 587
    data(6,588) = 1 1 4 0 0 -1 588 588
    data(6,589) = 1 1 4 0 0 -1 589 589
    data(6,590) = 1 1 4 0 0 -1 590 590
    data(6,591) = 1 1 4 0 0 -1 591 591
    data(6,592) = 1 1 4 0 0 -1 592 592
    data(6,593) = 1 1 4 0 0 -1 593 593
    data(6,594) = 1 1 4 0 0 -1 594 594
    data(6,595) = 1 1 4 0 0 -1 595 595
    data(6,596) = 1 1 4 0 0 -1 596 596
    data(6,597) = 1 1 4 0 0 -1 597 597
    data(6,598) = 1 1 4 0 0 -1 598 598
    data(6,599) = 1 1 4 0 0 -1 599 599
    data(6,600) = 1 1 4 0 0 -1 600 600
    data(6,601) = 1 1 4 0 0 -1 601 601
    data(6,602) = 1 1 4 0 0 -1 602 602
    data(6,603) = 1 1 4 0 0 -1 603 603
    data(6,604) = 1 1 4 0 0 -1 604 604
    data(6,605) = 1 1 4 0 0 -1 605 605
    data(6,606) = 1 1 4 0 0 -1 606 606
    data(6,607) = 1 1 4 0 0 -1 607 607
    data(6,608) = 1 1 4 0 0 -1 608 608
    data(6,609) = 1 1 4 0 0 -1 609 609
    data(6,610) = 1 1 4 0 0 -1 610 610
    data(6,611) = 1 1 4 0 0 -1 611 611
    data(6,612) = 1 1 4 0 0 -1 612 612
    data(6,613) = 1 1 4 0 0 -1 613 613
    data(6,614) = 1 1 4 0 0 -1 614 614
    data(6,615) = 1 1 4 0 0 -1 615 615
    data(6,616) = 1 1 4 0 0 -1 616 616
    data(6,617) = 1 1 4 0 0 -1 617 617
    data(6,618) = 1 1 4 0 0 -1 618 618
    data(6,619) = 1 1 4 0 0 -1 619 619
    data(6,620) = 1 1 4 0 0 -1 620 620
    data(6,621) = 1 1 4 0 0 -1 621 621
    data(6,622) = 1 1 4 0 0 -1 622 622
    data(6,623) = 1 1 4 0 0 -1 623 623
    data(6,624) = 1 1 4 0 0 -1 624 624
    data(6,625) = 1 1 4 0 0 -1 625 625
    data(6,626) = 1 1 4 0 0 -1 626 626
    data(6,627) = 1 1 4 0 0 -1 627 627
    data(6,628) = 1 1 4 0 0 -1 628 628
    data(6,629) = 1 1 4 0 0 -1 629 629
    data(6,630) = 1 1 4 0 0 -1 630 630
    data(6,631) = 1 1 4 0 0 -1 631 631
    data(6,632) = 1 1 4 0 0 -1 632 632
    data(6,633) = 1 1 4 0 0 -1 633 633
    data(6,634) = 1 1 4 0 0 -1 634 634
    data(6,635) = 1 1 4 0 0 -1 635 635
    data(6,636) = 1 1 4 0 0 -1 636 636
    data(6,637) = 1 1 4 0 0 -1 637 637
    data(6,638) = 1 1 4 0 0 -1 638 638
    data(6,639) = 1 1 4 0 0 -1 639 639
    data(6,640) = 1 1 4 0 0 -1 640 640
    data(6,641) = 1 1 4 0 0 -1 641 641
    data(6,642) = 1 1 4 0 0 -1 642 642
    data(6,643) = 1 1 4 0 0 -1 643 643
    data(6,644) = 1 1 4 0 0 -1 644 644
    data(6,645) = 1 1 4 0 0 -1 645 645
    data(6,646) = 1 1 4 0 0 -1 646 646
    data(6,647) = 1 1 4 0 0 -1 647 647
    data(6,648) = 1 1 4 0 0 -1 648 648
    data(6,649) = 1 1 4 0 0 -1 649 649
    data(6,650) = 1 1 4 0 0 -1 650 650
    data(6,651) = 1 1 4 0 0 -1 651 651
    data(6,652) = 1 1 4 0 0 -1 652 652
    data(6,653) = 1 1 4 0 0 -1 653 653
    data(6,654) = 1 1 4 0 0 -1 654 654
    data(6,655) = 1 1 4 0 0 -1 655 655
    data(6,656) = 1 1 4 0 0 -1 656 656
    data(6,657) = 1 1 4 0 0 -1 657 657
    data(6,658) = 1 1 4 0 0 -1 658 658
    data(6,659) = 1 1 4 0 0 -1 659 659
    data(6,660) = 1 1 4 0 0 -1 660 660
    data(6,661) = 1 1 4 0 0 -1 661 661
    data(6,662) = 1 1 4 0 0 -1 662 662
    data(6,663) = 1 1 4 0 0 -1 663 663
    data(6,664) = 1 1 4 0 0 -1 664 664
    data(6,665) = 1 1 4 0 0 -1 665 665
    data(6,666) = 1 1 4 0 0 -1 666 666
    data(6,667) = 1 1 4 0 0 -1 667 667
    data(6,668) = 1 1 4 0 0 -1 668 668
    data(6,669) = 1 1 4 0 0 -1 669 669
    data(6,670) = 1 1 4 0 0 -1 670 670
    data(6,671) = 1 1 4 0 0 -1 671 671
    data(6,672) = 1 1 4 0 0 -1 672 672
    data(6,673) = 1 1 4 0 0 -1 673 673
    data(6,674) = 1 1 4 0 0 -1 674 674
    data(6,675) = 1 1 4 0 0 -1 675 675
    data(6,676) = 1 1 4 0 0 -1 676 676
    data(6,677) = 1 1 4 0 0 -1 677 677
    data(6,678) = 1 1 4 0 0 -1 678 678
    data(6,679) = 1 1 4 0 0 -1 679 679
    data(6,680) = 1 1 4 0 0 -1 680 680
    data(6,681) = 1 1 4 0 0 -1 681 681
    data(6,682) = 1 1 4 0 0 -1 682 682
    data(6,683) = 1 1 4 0 0 -1 683 683
    data(6,684) = 1 1 4 0 0 -1 684 684
    data(6,685) = 1 1 4 0 0 -1 685 685
    data(6,686) = 1 1 4 0 0 -1 686 686
    data(6,687) = 1 1 4 0 0 -1 687 687
    data(6,688) = 1 1 4 0 0 -1 688 688
    data(6,689) = 1 1 4 0 0 -1 689 689
    data(6,690) = 1 1 4 0 0 -1 690 690
    data(6,691) = 1 1 4 0 0 -1 691 691
    data(6,692) = 1 1 4 0 0 -1 692 692
    data(6,693) = 1 1 4 0 0 -1 693 693
    data(6,694) = 1 1 4 0 0 -1 694 694
    data(6,695) = 1 1 4 0 0 -1 695 695
    data(6,696) = 1 1 4 0 0 -1 696 696
    data(6,697) = 1 1 4 0 0 -1 697 697
    data(6,698) = 1 1 4 0 0 -1 698 698
    data(6,699) = 1 1 4 0 0 -1 699 699
    data(6,700) = 1 1 4 0 0 -1 700 700
    data(6,701) = 1 1 4 0 0 -1 701 701
    data(6,702) = 1 1 4 0 0 -1 702 702
    data(6,703) = 1 1 4 0 0 -1 703 703
    data(6,704) = 1 1 4 0 0 -1 704 704
    data(6,705) = 1 1 4 0 0 -1 705 705
    data(6,706) = 1 1 4 0 0 -1 706 706
    data(6,707) = 1 1 4 0 0 -1 707 707
    data(6,708) = 1 1 4 0 0 -1 708 708
    data(6,709) = 1 1 4 0 0 -1 709 709
    data(6,710) = 1 1 4 0 0 -1 710 710
    data(6,711) = 1 1 4 0 0 -1 711 711
    data(6,712) = 1 1 4 0 0 -1 712 712
    data(6,713) = 1 1 4 0 0 -1 713 713
    data(6,714) = 1 1 4 0 0 -1 714 714
    data(6,715) = 1 1 4 0 0 -1 715 715
    data(6,716) = 1 1 4 0 0 -1 716 716
    data(6,717) = 1 1 4 0 0 -1 717 717
    data(6,718) = 1 1 4 0 0 -1 718 718
    data(6,719) = 1 1 4 0 0 -1 719 719
    data(6,720) = 1 1 4 0 0 -1 720 720
    data(6,721) = 1 1 4 0 0 -1 721 721
    data(6,722) = 1 1 4 0 0 -1 722 722
    data(6,723) = 1 1 4 0 0 -1 723 723
    data(6,724) = 1 1 4 0 0 -1 724 724
    data(6,725) = 1 1 4 0 0 -1 725 725
    data(6,726) = 1 1 4 0 0 -1 726 726
    data(6,727) = 1 1 4 0 0 -1 727 727
    data(6,728) = 1 1 4 0 0 -1 728 728
    data(6,729) = 1 1 4 0 0 -1 729 729
    data(6,730) = 1 1 4 0 0 -1 730 730
    data(6,731) = 1 1 4 0 0 -1 731 731
    data(6,732) = 1 1 4 0 0 -1 732 732
    data(6,733) = 1 1 4 0 0 -1 733 733
    data(6,734) = 1 1 4 0 0 -1 734 734
    data(6,735) = 1 1 4 0 0 -1 735 735
    data(6,736) = 1 1 4 0 0 -1 736 736
    data(6,737) = 1 1 4 0 0 -1 737 737
    data(6,738) = 1 1 4 0 0 -1 738 738
    data(6,739) = 1 1 4 0 0 -1 739 739
    data(6,740) = 1 1 4 0 0 -1 740 740
    data(6,741) = 1 1 4 0 0 -1 741 741
    data(6,742) = 1 1 4 0 0 -1 742 742
    data(6,743) = 1 1 4 0 0 -1 743 743
    data(6,744) = 1 1 4 0 0 -1 744 744
    data(6,745) = 1 1 4 0 0 -1 745 745
    data(6,746) = 1 1 4 0 0 -1 746 746
    data(6,747) = 1 1 4 0 0 -1 747 747
    data(6,748) = 1 1 4 0 0 -1 748 748
    data(6,749) = 1 1 4 0 0 -1 749 749
    data(6,750) = 1 1 4 0 0 -1 750 750
    data(6,751) = 1 1 4 0 0 -1 751 751
    data(6,752) = 1 1 4 0 0 -1 752 752
    data(6,753) = 1 1 4 0 0 -1 753 753
    data(6,754) = 1 1 4 0 0 -1 754 754
    data(6,755) = 1 1 4 0 0 -1 755 755
    data(6,756) = 1 1 4 0 0 -1 756 756
    data(6,757) = 1 1 4 0 0 -1 757 757
    data(6,758) = 1 1 4 0 0 -1 758 758
    data(6,759) = 1 1 4 0 0 -1 759 759
    data(6,760) = 1 1 4 0 0 -1 760 760
    data(6,761) = 1 1 4 0 0 -1 761 761
    data(6,762) = 1 1 4 0 0 -1 762 762
    data(6,763) = 1 1 4 0 0 -1 763 763
    data(6,764) = 1 1 4 0 0 -1 764 764
    data(6,765) = 1 1 4 0 0 -1 765 765
    data(6,766) = 1 1 4 0 0 -1 766 766
    data(6,767) = 1 1 4 0 0 -1 767 767
    data(6,768) = 1 1 4 0 0 -1 768 768
    data(6,769) = 1 1 4 0 0 -1 769 769
    data(6,770) = 1 1 4 0 0 -1 770 770
    data(6,771) = 1 1 4 0 0 -1 771 771
    data(6,772) = 1 1 4 0 0 -1 772 772
    data(6,773) = 1 1 4 0 0 -1 773 773
    data(6,774) = 1 1 4 0 0 -1 774 774
    data(6,775) = 1 1 4 0 0 -1 775 775
    data(6,776) = 1 1 4 0 0 -1 776 776
    data(6,777) = 1 1 4 0 0 -1 777 777
    data(6,778) = 1 1 4 0 0 -1 778 778
    data(6,779) = 1 1 4 0 0 -1 779 779
    data(6,780) = 1 1 4 0 0 -1 780 780
    data(6,781) = 1 1 4 0 0 -1 781 781
    data(6,782) = 1 1 4 0 0 -1 782 782
    data(6,783) = 1 1 4 0 0 -1 783 783
    data(6,784) = 1 1 4 0 0 -1 784 784
    data(6,785) = 1 1 4 0 0 -1 785 785
    data(6,786) = 1 1 4 0 0 -1 786 786
    data(6,787) = 1 1 4 0 0 -1 787 787
    data(6,788) = 1 1 4 0 0 -1 788 788
    data(6,789) = 1 1 4 0 0 -1 789 789
    data(6,790) = 1 1 4 0 0 -1 790 790
    data(6,791) = 1 1 4 0 0 -1 791 791
    data(6,792) = 1 1 4 0 0 -1 792 792
    data(6,793) = 1 1 4 0 0 -1 793 793
    data(6,794) = 1 1 4 0 0 -1 794 794
    data(6,795) = 1 1 4 0 0 -1 795 795
    data(6,796) = 1 1 4 0 0 -1 796 796
    data(6,797) = 1 1 4 0 0 -1 797 797
    data(6,798) = 1 1 4 0 0 -1 798 798
    data(6,799) = 1 1 4 0 0 -1 799 799
    data(6,800) = 1 1 4 0 0 -1 800 800
    data(6,801) = 1 1 4 0 0 -1 801 801
    data(6,802) = 1 1 4 0 0 -1 802 802
    data(6,803) = 1 1 4 0 0 -1 803 803
    data(6,804) = 1 1 4 0 0 -1 804 804
    data(6,805) = 1 1 4 0 0 -1 805 805
    data(6,806) = 1 1 4 0 0 -1 806 806
    data(6,807) = 1 1 4 0 0 -1 807 807
    data(6,808) = 1 1 4 0 0 -1 808 808
    data(6,809) = 1 1 4 0 0 -1 809 809
    data(6,810) = 1 1 4 0 0 -1 810 810
    data(6,811) = 1 1 4 0 0 -1 811 811
    data(6,812) = 1 1 4 0 0 -1 812 812
    data(6,813) = 1 1 4 0 0 -1 813 813
    data(6,814) = 1 1 4 0 0 -1 814 814
    data(6,815) = 1 1 4 0 0 -1 815 815
    data(6,816) = 1 1 4 0 0 -1 816 816
    data(6,817) = 1 1 4 0 0 -1 817 817
    data(6,818) = 1 1 4 0 0 -1 818 818
    data(6,819) = 1 1 4 0 0 -1 819 819
    data(6,820) = 1 1 4 0 0 -1 820 820
    data(6,821) = 1 1 4 0 0 -1 821 821
    data(6,822) = 1 1 4 0 0 -1 822 822
    data(6,823) = 1 1 4 0 0 -1 823 823
    data(6,824) = 1 1 4 0 0 -1 824 824
    data(6,825) = 1 1 4 0 0 -1 825 825
    data(6,826) = 1 1 4 0 0 -1 826 826
    data(6,827) = 1 1 4 0 0 -1 827 827
    data(6,828) = 1 1 4 0 0 -1 828 828
    data(6,829) = 1 1 4 0 0 -1 829 829
    data(6,830) = 1 1 4 0 0 -1 830 830
    data(6,831) = 1 1 4 0 0 -1 831 831
    data(6,832) = 1 1 4 0 0 -1 832 832
    data(6,833) = 1 1 4 0 0 -1 833 833
    data(6,834) = 1 1 4 0 0 -1 834 834
    data(6,835) = 1 1 4 0 0 -1 835 835
    data(6,836) = 1 1 4 0 0 -1 836 836
    data(6,837) = 1 1 4 0 0 -1 837 837
    data(6,838) = 1 1 4 0 0 -1 838 838
    data(6,839) = 1 1 4 0 0 -1 839 839
    data(6,840) = 1 1 4 0 0 -1 840 840
    data(6,841) = 1 1 4 0 0 -1 841 841
    data(6,842) = 1 1 4 0 0 -1 842 842
    data(6,843) = 1 1 4 0 0 -1 843 843
    data(6,844) = 1 1 4 0 0 -1 844 844
    data(6,845) = 1 1 4 0 0 -1 845 845
    data(6,846) = 1 1 4 0 0 -1 846 846
    data(6,847) = 1 1 4 0 0 -1 847 847
    data(6,848) = 1 1 4 0 0 -1 848 848
    data(6,849) = 1 1 4 0 0 -1 849 849
    data(6,850) = 1 1 4 0 0 -1 850 850
    data(6,851) = 1 1 4 0 0 -1 851 851
    data(6,852) = 1 1 4 0 0 -1 852 852
    data(6,853) = 1 1 4 0 0 -1 853 853
    data(6,854) = 1 1 4 0 0 -1 854 854
    data(6,855) = 1 1 4 0 0 -1 855 855
    data(6,856) = 1 1 4 0 0 -1 856 856
    data(6,857) = 1 1 4 0 0 -1 857 857
    data(6,858) = 1 1 4 0 0 -1 858 858
    data(6,859) = 1 1 4 0 0 -1 859 859
    data(6,860) = 1 1 4 0 0 -1 860 860
    data(6,861) = 1 1 4 0 0 -1 861 861
    data(6,862) = 1 1 4 0 0 -1 862 862
    data(6,863) = 1 1 4 0 0 -1 863 863
    data(6,864) = 1 1 4 0 0 -1 864 864
    data(6,865) = 1 1 4 0 0 -1 865 865
    data(6,866) = 1 1 4 0 0 -1 866 866
    data(6,867) = 1 1 4 0 0 -1 867 867
    data(6,868) = 1 1 4 0 0 -1 868 868
    data(6,869) = 1 1 4 0 0 -1 869 869
    data(6,870) = 1 1 4 0 0 -1 870 870
    data(6,871) = 1 1 4 0 0 -1 871 871
    data(6,872) = 1 1 4 0 0 -1 872 872
    data(6,873) = 1 1 4 0 0 -1 873 873
    data(6,874) = 1 1 4 0 0 -1 874 874
    data(6,875) = 1 1 4 0 0 -1 875 875
    data(6,876) = 1 1 4 0 0 -1 876 876
    data(6,877) = 1 1 4 0 0 -1 877 877
    data(6,878) = 1 1 4 0 0 -1 878 878
    data(6,879) = 1 1 4 0 0 -1 879 879
    data(6,880) = 1 1 4 0 0 -1 880 880
    data(6,881) = 1 1 4 0 0 -1 881 881
    data(6,882) = 1 1 4 0 0 -1 882 882
    data(6,883) = 1 1 4 0 0 -1 883 883
    data(6,884) = 1 1 4 0 0 -1 884 884
    data(6,885) = 1 1 4 0 0 -1 885 885
    data(6,886) = 1 1 4 0 0 -1 886 886
    data(6,887) = 1 1 4 0 0 -1 887 887
    data(6,888) = 1 1 4 0 0 -1 888 888
    data(6,889) = 1 1 4 0 0 -1 889 889
    data(6,890) = 1 1 4 0 0 -1 890 890
    data(6,891) = 1 1 4 0 0 -1 891 891
    data(6,892) = 1 1 4 0 0 -1 892 892
    data(6,893) = 1 1 4 0 0 -1 893 893
    data(6,894) = 1 1 4 0 0 -1 894 894
    data(6,895) = 1 1 4 0 0 -1 895 895
    data(6,896) = 1 1 4 0 0 -1 896 896
    data(6,897) = 1 1 4 0 0 -1 897 897
    data(6,898) = 1 1 4 0 0 -1 898 898
    data(6,899) = 1 1 4 0 0 -1 899 899
    data(6,900) = 1 1 4 0 0 -1 900 900
    data(6,901) = 1 1 4 0 0 -1 901 901
    data(6,902) = 1 1 4 0 0 -1 902 902
    data(6,903) = 1 1 4 0 0 -1 903 903
    data(6,904) = 1 1 4 0 0 -1 904 904
    data(6,905) = 1 1 4 0 0 -1 905 905
    data(6,906) = 1 1 4 0 0 -1 906 906
    data(6,907) = 1 1 4 0 0 -1 907 907
    data(6,908) = 1 1 4 0 0 -1 908 908
    data(6,909) = 1 1 4 0 0 -1 909 909
    data(6,910) = 1 1 4 0 0 -1 910 910
    data(6,911) = 1 1 4 0 0 -1 911 911
    data(6,912) = 1 1 4 0 0 -1 912 912
    data(6,913) = 1 1 4 0 0 -1 913 913
    data(6,914) = 1 1 4 0 0 -1 914 914
    data(6,915) = 1 1 4 0 0 -1 915 915
    data(6,916) = 1 1 4 0 0 -1 916 916
    data(6,917) = 1 1 4 0 0 -1 917 917
    data(6,918) = 1 1 4 0 0 -1 918 918
    data(6,919) = 1 1 4 0 0 -1 919 919
    data(6,920) = 1 1 4 0 0 -1 920 920
    data(6,921) = 1 1 4 0 0 -1 921 921
    data(6,922) = 1 1 4 0 0 -1 922 922
    data(6,923) = 1 1 4 0 0 -1 923 923
    data(6,924) = 1 1 4 0 0 -1 924 924
    data(6,925) = 1 1 4 0 0 -1 925 925
    data(6,926) = 1 1 4 0 0 -1 926 926
    data(6,927) = 1 1 4 0 0 -1 927 927
    data(6,928) = 1 1 4 0 0 -1 928 928
    data(6,929) = 1 1 4 0 0 -1 929 929
    data(6,930) = 1 1 4 0 0 -1 930 930
    data(6,931) = 1 1 4 0 0 -1 931 931
    data(6,932) = 1 1 4 0 0 -1 932 932
    data(6,933) = 1 1 4 0 0 -1 933 933
    data(6,934) = 1 1 4 0 0 -1 934 934
    data(6,935) = 1 1 4 0 0 -1 935 935
    data(6,936) = 1 1 4 0 0 -1 936 936
    data(6,937) = 1 1 4 0 0 -1 937 937
    data(6,938) = 1 1 4 0 0 -1 938 938
    data(6,939) = 1 1 4 0 0 -1 939 939
    data(6,940) = 1 1 4 0 0 -1 940 940
    data(6,941) = 1 1 4 0 0 -1 941 941
    data(6,942) = 1 1 4 0 0 -1 942 942
    data(6,943) = 1 1 4 0 0 -1 943 943
    data(6,944) = 1 1 4 0 0 -1 944 944
    data(6,945) = 1 1 4 0 0 -1 945 945
    data(6,946) = 1 1 4 0 0 -1 946 946
    data(6,947) = 1 1 4 0 0 -1 947 947
    data(6,948) = 1 1 4 0 0 -1 948 948
    data(6,949) = 1 1 4 0 0 -1 949 949
    data(6,950) = 1 1 4 0 0 -1 950 950
    data(6,951) = 1 1 4 0 0 -1 951 951
    data(6,952) = 1 1 4 0 0 -1 952 952
    data(6,953) = 1 1 4 0 0 -1 953 953
    data(6,954) = 1 1 4 0 0 -1 954 954
    data(6,955) = 1 1 4 0 0 -1 955 955
    data(6,956) = 1 1 4 0 0 -1 956 956
    data(6,957) = 1 1 4 0 0 -1 957 957
    data(6,958) = 1 1 4 0 0 -1 958 958
    data(6,959) = 1 1 4 0 0 -1 959 959
    data(6,960) = 1 1 4 0 0 -1 960 960
    data(6,961) = 1 1 4 0 0 -1 961 961
    data(6,962) = 1 1 4 0 0 -1 962 962
    data(6,963) = 1 1 4 0 0 -1 963 963
    data(6,964) = 1 1 4 0 0 -1 964 964
    data(6,965) = 1 1 4 0 0 -1 965 965
    data(6,966) = 1 1 4 0 0 -1 966 966
    data(6,967) = 1 1 4 0 0 -1 967 967
    data(6,968) = 1 1 4 0 0 -1 968 968
    data(6,969) = 1 1 4 0 0 -1 969 969
    data(6,970) = 1 1 4 0 0 -1 970 970
    data(6,971) = 1 1 4 0 0 -1 971 971
    data(6,972) = 1 1 4 0 0 -1 972 972
    data(6,973) = 1 1 4 0 0 -1 973 973
    data(6,974) = 1 1 4 0 0 -1 974 974
    data(6,975) = 1 1 4 0 0 -1 975 975
    data(6,976) = 1 1 4 0 0 -1 976 976
    data(6,977) = 1 1 4 0 0 -1 977 977
    data(6,978) = 1 1 4 0 0 -1 978 978
    data(6,979) = 1 1 4 0 0 -1 979 979
    data(6,980) = 1 1 4 0 0 -1 980 980
    data(6,981) = 1 1 4 0 0 -1 981 981
    data(6,982) = 1 1 4 0 0 -1 982 982
    data(6,983) = 1 1 4 0 0 -1 983 983
    data(6,984) = 1 1 4 0 0 -1 984 984
    data(6,985) = 1 1 4 0 0 -1 985 985
    data(6,986) = 1 1 4 0 0 -1 986 986
    data(6,987) = 1 1 4 0 0 -1 987 987
    data(6,988) = 1 1 4 0 0 -1 988 988
    data(6,989) = 1 1 4 0 0 -1 989 989
    data(6,990) = 1 1 4 0 0 -1 990 990
    data(6,991) = 1 1 4 0 0 -1 991 991
    data(6,992) = 1 1 4 0 0 -1 992 992
    data(6,993) = 1 1 4 0 0 -1 993 993
    data(6,994) = 1 1 4 0 0 -1 994 994
    data(6,995) = 1 1 4 0 0 -1 995 995
    data(6,996) = 1 1 4 0 0 -1 996 996
    data(6,997) = 1 1 4 0 0 -1 997 997
    data(6,998) = 1 1 4 0 0 -1 998 998
    data(6,999) = 1 1 4 0 0 -1 999 999
    data(6,1000) = 1 1 4 0 0 -1 1000 1000
    data(6,1001) = 1 1 4 0 0 -1 1001 1001
    data(6,1002) = 1 1 4 0 0 -1 1002 1002
    data(6,1003) = 1 1 4 0 0 -1 1003 1003
    data(6,1004) = 1 1 4 0 0 -1 1004 1004
    data(6,1005) = 1 1 4 0 0 -1 1005 1005
    data(6,1006) = 1 1 4 0 0 -1 1006 1006
    data(6,1007) = 1 1 4 0 0 -1 1007 1007
    data(6,1008) = 1 1 4 0 0 -1 1008 1008
    data(6,1009) = 1 1 4 0 0 -1 1009 1009
    data(6,1010) = 1 1 4 0 0 -1 1010 1010
    data(6,1011) = 1 1 4 0 0 -1 1011 1011
    data(6,1012) = 1 1 4 0 0 -1 1012 1012
    data(6,1013) = 1 1 4 0 0 -1 1013 1013
    data(6,1014) = 1 1 4 0 0 -1 1014 1014
    data(6,1015) = 1 1 4 0 0 -1 1015 1015
    data(6,1016) = 1 1 4 0 0 -1 1016 1016
    data(6,1017) = 1 1 4 0 0 -1 1017 1017
    data(6,1018) = 1 1 4 0 0 -1 1018 1018
    data(6,1019) = 1 1 4 0 0 -1 1019 1019
    data(6,1020) = 1 1 4 0 0 -1 1020 1020
    data(6,1021) = 1 1 4 0 0 -1 1021 1021
    data(6,1022) = 1 1 4 0 0 -1 1022 1022
    data(6,1023) = 1 1 4 0 0 -1 1023 1023
    data(6,1024) = 1 1 4 0 0 -1 1024 1024
    data(6,1025) = 1 1 4 0 0 -1 1025 1025
    data(6,1026) = 1 1 4 0 0 -1 1026 1026
    data(6,1027) = 1 1 4 0 0 -1 1027 1027
    data(6,1028) = 1 1 4 0 0 -1 1028 1028
    data(6,1029) = 1 1 4 0 0 -1 1029 1029
    data(6,1030) = 1 1 4 0 0 -1 1030 1030
    data(6,1031) = 1 1 4 0 0 -1 1031 1031
    data(6,1032) = 1 1 4 0 0 -1 1032 1032
    data(6,1033) = 1 1 4 0 0 -1 1033 1033
    data(6,1034) = 1 1 4 0 0 -1 1034 1034
    data(6,1035) = 1 1 4 0 0 -1 1035 1035
    data(6,1036) = 1 1 4 0 0 -1 1036 1036
    data(6,1037) = 1 1 4 0 0 -1 1037 1037
    data(6,1038) = 1 1 4 0 0 -1 1038 1038
    data(6,1039) = 1 1 4 0 0 -1 1039 1039
    data(6,1040) = 1 1 4 0 0 -1 1040 1040
    data(6,1041) = 1 1 4 0 0 -1 1041 1041
    data(6,1042) = 1 1 4 0 0 -1 1042 1042
    data(6,1043) = 1 1 4 0 0 -1 1043 1043
    data(6,1044) = 1 1 4 0 0 -1 1044 1044
    data(6,1045) = 1 1 4 0 0 -1 1045 1045
    data(6,1046) = 1 1 4 0 0 -1 1046 1046
    data(6,1047) = 1 1 4 0 0 -1 1047 1047
    data(6,1048) = 1 1 4 0 0 -1 1048 1048
    data(6,1049) = 1 1 4 0 0 -1 1049 1049
    data(6,1050) = 1 1 4 0 0 -1 1050 1050
    data(6,1051) = 1 1 4 0 0 -1 1051 1051
    data(6,1052) = 1 1 4 0 0 -1 1052 1052
    data(6,1053) = 1 1 4 0 0 -1 1053 1053
    data(6,1054) = 1 1 4 0 0 -1 1054 1054
    data(6,1055) = 1 1 4 0 0 -1 1055 1055
    data(6,1056) = 1 1 4 0 0 -1 1056 1056
    data(6,1057) = 1 1 4 0 0 -1 1057 1057
    data(6,1058) = 1 1 4 0 0 -1 1058 1058
    data(6,1059) = 1 1 4 0 0 -1 1059 1059
    data(6,1060) = 1 1 4 0 0 -1 1060 1060
    data(6,1061) = 1 1 4 0 0 -1 1061 1061
    data(6,1062) = 1 1 4 0 0 -1 1062 1062
    data(6,1063) = 1 1 4 0 0 -1 1063 1063
    data(6,1064) = 1 1 4 0 0 -1 1064 1064
    data(6,1065) = 1 1 4 0 0 -1 1065 1065
    data(6,1066) = 1 1 4 0 0 -1 1066 1066
    data(6,1067) = 1 1 4 0 0 -1 1067 1067
    data(6,1068) = 1 1 4 0 0 -1 1068 1068
    data(6,1069) = 1 1 4 0 0 -1 1069 1069
    data(6,1070) = 1 1 4 0 0 -1 1070 1070
    data(6,1071) = 1 1 4 0 0 -1 1071 1071
    data(6,1072) = 1 1 4 0 0 -1 1072 1072
    data(6,1073) = 1 1 4 0 0 -1 1073 1073
    data(6,1074) = 1 1 4 0 0 -1 1074 1074
    data(6,1075) = 1 1 4 0 0 -1 1075 1075
    data(6,1076) = 1 1 4 0 0 -1 1076 1076
    data(6,1077) = 1 1 4 0 0 -1 1077 1077
    data(6,1078) = 1 1 4 0 0 -1 1078 1078
    data(6,1079) = 1 1 4 0 0 -1 1079 1079
    data(6,1080) = 1 1 4 0 0 -1 1080 1080
    data(6,1081) = 1 1 4 0 0 -1 1081 1081
    data(6,1082) = 1 1 4 0 0 -1 1082 1082
    data(6,1083) = 1 1 4 0 0 -1 1083 1083
    data(6,1084) = 1 1 4 0 0 -1 1084 1084
    data(6,1085) = 1 1 4 0 0 -1 1085 1085
    data(6,1086) = 1 1 4 0 0 -1 1086 1086
    data(6,1087) = 1 1 4 0 0 -1 1087 1087
    data(6,1088) = 1 1 4 0 0 -1 1088 1088
    data(6,1089) = 1 1 4 0 0 -1 1089 1089
    data(6,1090) = 1 1 4 0 0 -1 1090 1090
    data(6,1091) = 1 1 4 0 0 -1 1091 1091
    data(6,1092) = 1 1 4 0 0 -1 1092 1092
    data(6,1093) = 1 1 4 0 0 -1 1093 1093
    data(6,1094) = 1 1 4 0 0 -1 1094 1094
    data(6,1095) = 1 1 4 0 0 -1 1095 1095
    data(6,1096) = 1 1 4 0 0 -1 1096 1096
    data(6,1097) = 1 1 4 0 0 -1 1097 1097
    data(6,1098) = 1 1 4 0 0 -1 1098 1098
    data(6,1099) = 1 1 4 0 0 -1 1099 1099
    data(6,1100) = 1 1 4 0 0 -1 1100 1100
    data(6,1101) = 1 1 4 0 0 -1 1101 1101
    data(6,1102) = 1 1 4 0 0 -1 1102 1102
    data(6,1103) = 1 1 4 0 0 -1 1103 1103
    data(6,1104) = 1 1 4 0 0 -1 1104 1104
    data(6,1105) = 1 1 4 0 0 -1 1105 1105
    data(6,1106) = 1 1 4 0 0 -1 1106 1106
    data(6,1107) = 1 1 4 0 0 -1 1107 1107
    data(6,1108) = 1 1 4 0 0 -1 1108 1108
    data(6,1109) = 1 1 4 0 0 -1 1109 1109
    data(6,1110) = 1 1 4 0 0 -1 1110 1110
    data(6,1111) = 1 1 4 0 0 -1 1111 1111
    data(6,1112) = 1 1 4 0 0 -1 1112 1112
    data(6,1113) = 1 1 4 0 0 -1 1113 1113
    data(6,1114) = 1 1 4 0 0 -1 1114 1114
    data(6,1115) = 1 1 4 0 0 -1 1115 1115
    data(6,1116) = 1 1 4 0 0 -1 1116 1116
    data(6,1117) = 1 1 4 0 0 -1 1117 1117
    data(6,1118) = 1 1 4 0 0 -1 1118 1118
    data(6,1119) = 1 1 4 0 0 -1 1119 1119
    data(6,1120) = 1 1 4 0 0 -1 1120 1120
    data(6,1121) = 1 1 4 0 0 -1 1121 1121
    data(6,1122) = 1 1 4 0 0 -1 1122 1122
    data(6,1123) = 1 1 4 0 0 -1 1123 1123
    data(6,1124) = 1 1 4 0 0 -1 1124 1124
    data(6,1125) = 1 1 4 0 0 -1 1125 1125
    data(6,1126) = 1 1 4 0 0 -1 1126 1126
    data(6,1127) = 1 1 4 0 0 -1 1127 1127
    data(6,1128) = 1 1 4 0 0 -1 1128 1128
    data(6,1129) = 1 1 4 0 0 -1 1129 1129
    data(6,1130) = 1 1 4 0 0 -1 1130 1130
    data(6,1131) = 1 1 4 0 0 -1 1131 1131
    data(6,1132) = 1 1 4 0 0 -1 1132 1132
    data(6,1133) = 1 1 4 0 0 -1 1133 1133
    data(6,1134) = 1 1 4 0 0 -1 1134 1134
    data(6,1135) = 1 1 4 0 0 -1 1135 1135
    data(6,1136) = 1 1 4 0 0 -1 1136 1136
    data(6,1137) = 1 1 4 0 0 -1 1137 1137
    data(6,1138) = 1 1 4 0 0 -1 1138 1138
    data(6,1139) = 1 1 4 0 0 -1 1139 1139
    data(6,1140) = 1 1 4 0 0 -1 1140 1140
    data(6,1141) = 1 1 4 0 0 -1 1141 1141
    data(6,1142) = 1 1 4 0 0 -1 1142 1142
    data(6,1143) = 1 1 4 0 0 -1 1143 1143
    data(6,1144) = 1 1 4 0 0 -1 1144 1144
    data(6,1145) = 1 1 4 0 0 -1 1145 1145
    data(6,1146) = 1 1 4 0 0 -1 1146 1146
    data(6,1147) = 1 1 4 0 0 -1 1147 1147
    data(6,1148) = 1 1 4 0 0 -1 1148 1148
    data(6,1149) = 1 1 4 0 0 -1 1149 1149
    data(6,1150) = 1 1 4 0 0 -1 1150 1150
    data(6,1151) = 1 1 4 0 0 -1 1151 1151
    data(6,1152) = 1 1 4 0 0 -1 1152 1152
    data(6,1153) = 1 1 4 0 0 -1 1153 1153
    data(6,1154) = 1 1 4 0 0 -1 1154 1154
    data(6,1155) = 1 1 4 0 0 -1 1155 1155
    data(6,1156) = 1 1 4 0 0 -1 1156 1156
    data(6,1157) = 1 1 4 0 0 -1 1157 1157
    data(6,1158) = 1 1 4 0 0 -1 1158 1158
    data(6,1159) = 1 1 4 0 0 -1 1159 1159
    data(6,1160) = 1 1 4 0 0 -1 1160 1160
    data(6,1161) = 1 1 4 0 0 -1 1161 1161
    data(6,1162) = 1 1 4 0 0 -1 1162 1162
    data(6,1163) = 1 1 4 0 0 -1 1163 1163
    data(6,1164) = 1 1 4 0 0 -1 1164 1164
    data(6,1165) = 1 1 4 0 0 -1 1165 1165
    data(6,1166) = 1 1 4 0 0 -1 1166 1166
    data(6,1167) = 1 1 4 0 0 -1 1167 1167
    data(6,1168) = 1 1 4 0 0 -1 1168 1168
    data(6,1169) = 1 1 4 0 0 -1 1169 1169
    data(6,1170) = 1 1 4 0 0 -1 1170 1170
    data(6,1171) = 1 1 4 0 0 -1 1171 1171
    data(6,1172) = 1 1 4 0 0 -1 1172 1172
    data(6,1173) = 1 1 4 0 0 -1 1173 1173
    data(6,1174) = 1 1 4 0 0 -1 1174 1174
    data(6,1175) = 1 1 4 0 0 -1 1175 1175
    data(6,1176) = 1 1 4 0 0 -1 1176 1176
    data(6,1177) = 1 1 4 0 0 -1 1177 1177
    data(6,1178) = 1 1 4 0 0 -1 1178 1178
    data(6,1179) = 1 1 4 0 0 -1 1179 1179
    data(6,1180) = 1 1 4 0 0 -1 1180 1180
    data(6,1181) = 1 1 4 0 0 -1 1181 1181
    data(6,1182) = 1 1 4 0 0 -1 1182 1182
    data(6,1183) = 1 1 4 0 0 -1 1183 1183
    data(6,1184) = 1 1 4 0 0 -1 1184 1184
    data(6,1185) = 1 1 4 0 0 -1 1185 1185
    data(6,1186) = 1 1 4 0 0 -1 1186 1186
    data(6,1187) = 1 1 4 0 0 -1 1187 1187
    data(6,1188) = 1 1 4 0 0 -1 1188 1188
    data(6,1189) = 1 1 4 0 0 -1 1189 1189
    data(6,1190) = 1 1 4 0 0 -1 1190 1190
    data(6,1191) = 1 1 4 0 0 -1 1191 1191
    data(6,1192) = 1 1 4 0 0 -1 1192 1192
    data(6,1193) = 1 1 4 0 0 -1 1193 1193
    data(6,1194) = 1 1 4 0 0 -1 1194 1194
    data(6,1195) = 1 1 4 0 0 -1 1195 1195
    data(6,1196) = 1 1 4 0 0 -1 1196 1196
    data(6,1197) = 1 1 4 0 0 -1 1197 1197
    data(6,1198) = 1 1 4 0 0 -1 1198 1198
    data(6,1199) = 1 1 4 0 0 -1 1199 1199
    data(6,1200) = 1 1 4 0 0 -1 1200 1200
    data(6,1201) = 1 1 4 0 0 -1 1201 1201
    data(6,1202) = 1 1 4 0 0 -1 1202 1202
    data(6,1203) = 1 1 4 0 0 -1 1203 1203
    data(6,1204) = 1 1 4 0 0 -1 1204 1204
    data(6,1205) = 1 1 4 0 0 -1 1205 1205
    data(6,1206) = 1 1 4 0 0 -1 1206 1206
    data(6,1207) = 1 1 4 0 0 -1 1207 1207
    data(6,1208) = 1 1 4 0 0 -1 1208 1208
    data(6,1209) = 1 1 4 0 0 -1 1209 1209
    data(6,1210) = 1 1 4 0 0 -1 1210 1210
    data(6,1211) = 1 1 4 0 0 -1 1211 1211
    data(6,1212) = 1 1 4 0 0 -1 1212 1212
    data(6,1213) = 1 1 4 0 0 -1 1213 1213
    data(6,1214) = 1 1 4 0 0 -1 1214 1214
    data(6,1215) = 1 1 4 0 0 -1 1215 1215
    data(6,1216) = 1 1 4 0 0 -1 1216 1216
    data(6,1217) = 1 1 4 0 0 -1 1217 1217
    data(6,1218) = 1 1 4 0 0 -1 1218 1218
    data(6,1219) = 1 1 4 0 0 -1 1219 1219
    data(6,1220) = 1 1 4 0 0 -1 1220 1220
    data(6,1221) = 1 1 4 0 0 -1 1221 1221
    data(6,1222) = 1 1 4 0 0 -1 1222 1222
    data(6,1223) = 1 1 4 0 0 -1 1223 1223
    data(6,1224) = 1 1 4 0 0 -1 1224 1224
    data(6,1225) = 1 1 4 0 0 -1 1225 1225
    data(6,1226) = 1 1 4 0 0 -1 1226 1226
    data(6,1227) = 1 1 4 0 0 -1 1227 1227
    data(6,1228) = 1 1 4 0 0 -1 1228 1228
    data(6,1229) = 1 1 4 0 0 -1 1229 1229
    data(6,1230) = 1 1 4 0 0 -1 1230 1230
    data(6,1231) = 1 1 4 0 0 -1 1231 1231
    data(6,1232) = 1 1 4 0 0 -1 1232 1232
    data(6,1233) = 1 1 4 0 0 -1 1233 1233
    data(6,1234) = 1 1 4 0 0 -1 1234 1234
    data(6,1235) = 1 1 4 0 0 -1 1235 1235
    data(6,1236) = 1 1 4 0 0 -1 1236 1236
    data(6,1237) = 1 1 4 0 0 -1 1237 1237
    data(6,1238) = 1 1 4 0 0 -1 1238 1238
    data(6,1239) = 1 1 4 0 0 -1 1239 1239
    data(6,1240) = 1 1 4 0 0 -1 1240 1240
    data(6,1241) = 1 1 4 0 0 -1 1241 1241
    data(6,1242) = 1 1 4 0 0 -1 1242 1242
    data(6,1243) = 1 1 4 0 0 -1 1243 1243
    data(6,1244) = 1 1 4 0 0 -1 1244 1244
    data(6,1245) = 1 1 4 0 0 -1 1245 1245
    data(6,1246) = 1 1 4 0 0 -1 1246 1246
    data(6,1247) = 1 1 4 0 0 -1 1247 1247
    data(6,1248) = 1 1 4 0 0 -1 1248 1248
    data(6,1249) = 1 1 4 0 0 -1 1249 1249
    data(6,1250) = 1 1 4 0 0 -1 1250 1250
    data(6,1251) = 1 1 4 0 0 -1 1251 1251
    data(6,1252) = 1 1 4 0 0 -1 1252 1252
    data(6,1253) = 1 1 4 0 0 -1 1253 1253
    data(6,1254) = 1 1 4 0 0 -1 1254 1254
    data(6,1255) = 1 1 4 0 0 -1 1255 1255
    data(6,1256) = 1 1 4 0 0 -1 1256 1256
    data(6,1257) = 1 1 4 0 0 -1 1257 1257
    data(6,1258) = 1 1 4 0 0 -1 1258 1258
    data(6,1259) = 1 1 4 0 0 -1 1259 1259
    data(6,1260) = 1 1 4 0 0 -1 1260 1260
    data(6,1261) = 1 1 4 0 0 -1 1261 1261
    data(6,1262) = 1 1 4 0 0 -1 1262 1262
    data(6,1263) = 1 1 4 0 0 -1 1263 1263
    data(6,1264) = 1 1 4 0 0 -1 1264 1264
    data(6,1265) = 1 1 4 0 0 -1 1265 1265
    data(6,1266) = 1 1 4 0 0 -1 1266 1266
    data(6,1267) = 1 1 4 0 0 -1 1267 1267
    data(6,1268) = 1 1 4 0 0 -1 1268 1268
    data(6,1269) = 1 1 4 0 0 -1 1269 1269
    data(6,1270) = 1 1 4 0 0 -1 1270 1270
    data(6,1271) = 1 1 4 0 0 -1 1271 1271
    data(6,1272) = 1 1 4 0 0 -1 1272 1272
    data(6,1273) = 1 1 4 0 0 -1 1273 1273
    data(6,1274) = 1 1 4 0 0 -1 1274 1274
    data(6,1275) = 1 1 4 0 0 -1 1275 1275
    data(6,1276) = 1 1 4 0 0 -1 1276 1276
    data(6,1277) = 1 1 4 0 0 -1 1277 1277
    data(6,1278) = 1 1 4 0 0 -1 1278 1278
    data(6,1279) = 1 1 4 0 0 -1 1279 1279
    data(6,1280) = 1 1 4 0 0 -1 1280 1280
    data(6,1281) = 1 1 4 0 0 -1 1281 1281
    data(6,1282) = 1 1 4 0 0 -1 1282 1282
    data(6,1283) = 1 1 4 0 0 -1 1283 1283
    data(6,1284) = 1 1 4 0 0 -1 1284 1284
    data(6,1285) = 1 1 4 0 0 -1 1285 1285
    data(6,1286) = 1 1 4 0 0 -1 1286 1286
    data(6,1287) = 1 1 4 0 0 -1 1287 1287
    data(6,1288) = 1 1 4 0 0 -1 1288 1288
    data(6,1289) = 1 1 4 0 0 -1 1289 1289
    data(6,1290) = 1 1 4 0 0 -1 1290 1290
    data(6,1291) = 1 1 4 0 0 -1 1291 1291
    data(6,1292) = 1 1 4 0 0 -1 1292 1292
    data(6,1293) = 1 1 4 0 0 -1 1293 1293
    data(6,1294) = 1 1 4 0 0 -1 1294 1294
    data(6,1295) = 1 1 4 0 0 -1 1295 1295
    data(6,1296) = 1 1 4 0 0 -1 1296 1296
    data(6,1297) = 1 1 4 0 0 -1 1297 1297
    data(6,1298) = 1 1 4 0 0 -1 1298 1298
    data(6,1299) = 1 1 4 0 0 -1 1299 1299
    data(6,1300) = 1 1 4 0 0 -1 1300 1300
    data(6,1301) = 1 1 4 0 0 -1 1301 1301
    data(6,1302) = 1 1 4 0 0 -1 1302 1302
    data(6,1303) = 1 1 4 0 0 -1 1303 1303
    data(6,1304) = 1 1 4 0 0 -1 1304 1304
    data(6,1305) = 1 1 4 0 0 -1 1305 1305
    data(6,1306) = 1 1 4 0 0 -1 1306 1306
    data(6,1307) = 1 1 4 0 0 -1 1307 1307
    data(6,1308) = 1 1 4 0 0 -1 1308 1308
    data(6,1309) = 1 1 4 0 0 -1 1309 1309
    data(6,1310) = 1 1 4 0 0 -1 1310 1310
    data(6,1311) = 1 1 4 0 0 -1 1311 1311
    data(6,1312) = 1 1 4 0 0 -1 1312 1312
    data(6,1313) = 1 1 4 0 0 -1 1313 1313
    data(6,1314) = 1 1 4 0 0 -1 1314 1314
    data(6,1315) = 1 1 4 0 0 -1 1315 1315
    data(6,1316) = 1 1 4 0 0 -1 1316 1316
    data(6,1317) = 1 1 4 0 0 -1 1317 1317
    data(6,1318) = 1 1 4 0 0 -1 1318 1318
    data(6,1319) = 1 1 4 0 0 -1 1319 1319
    data(6,1320) = 1 1 4 0 0 -1 1320 1320
    data(6,1321) = 1 1 4 0 0 -1 1321 1321
    data(6,1322) = 1 1 4 0 0 -1 1322 1322
    data(6,1323) = 1 1 4 0 0 -1 1323 1323
    data(6,1324) = 1 1 4 0 0 -1 1324 1324
    data(6,1325) = 1 1 4 0 0 -1 1325 1325
    data(6,1326) = 1 1 4 0 0 -1 1326 1326
    data(6,1327) = 1 1 4 0 0 -1 1327 1327
    data(6,1328) = 1 1 4 0 0 -1 1328 1328
    data(6,1329) = 1 1 4 0 0 -1 1329 1329
    data(6,1330) = 1 1 4 0 0 -1 1330 1330
    data(6,1331) = 1 1 4 0 0 -1 1331 1331
    data(6,1332) = 1 1 4 0 0 -1 1332 1332
    data(6,1333) = 1 1 4 0 0 -1 1333 1333
    data(6,1334) = 1 1 4 0 0 -1 1334 1334
    data(6,1335) = 1 1 4 0 0 -1 1335 1335
    data(6,1336) = 1 1 4 0 0 -1 1336 1336
    data(6,1337) = 1 1 4 0 0 -1 1337 1337
    data(6,1338) = 1 1 4 0 0 -1 1338 1338
    data(6,1339) = 1 1 4 0 0 -1 1339 1339
    data(6,1340) = 1 1 4 0 0 -1 1340 1340
    data(6,1341) = 1 1 4 0 0 -1 1341 1341
    data(6,1342) = 1 1 4 0 0 -1 1342 1342
    data(6,1343) = 1 1 4 0 0 -1 1343 1343
    data(6,1344) = 1 1 4 0 0 -1 1344 1344
    data(6,1345) = 1 1 4 0 0 -1 1345 1345
    data(6,1346) = 1 1 4 0 0 -1 1346 1346
    data(6,1347) = 1 1 4 0 0 -1 1347 1347
    data(6,1348) = 1 1 4 0 0 -1 1348 1348
    data(6,1349) = 1 1 4 0 0 -1 1349 1349
    data(6,1350) = 1 1 4 0 0 -1 1350 1350
    data(6,1351) = 1 1 4 0 0 -1 1351 1351
    data(6,1352) = 1 1 4 0 0 -1 1352 1352
    data(6,1353) = 1 1 4 0 0 -1 1353 1353
    data(6,1354) = 1 1 4 0 0 -1 1354 1354
    data(6,1355) = 1 1 4 0 0 -1 1355 1355
    data(6,1356) = 1 1 4 0 0 -1 1356 1356
    data(6,1357) = 1 1 4 0 0 -1 1357 1357
    data(6,1358) = 1 1 4 0 0 -1 1358 1358
    data(6,1359) = 1 1 4 0 0 -1 1359 1359
    data(6,1360) = 1 1 4 0 0 -1 1360 1360
    data(6,1361) = 1 1 4 0 0 -1 1361 1361
    data(6,1362) = 1 1 4 0 0 -1 1362 1362
    data(6,1363) = 1 1 4 0 0 -1 1363 1363
    data(6,1364) = 1 1 4 0 0 -1 1364 1364
    data(6,1365) = 1 1 4 0 0 -1 1365 1365
    data(6,1366) = 1 1 4 0 0 -1 1366 1366
    data(6,1367) = 1 1 4 0 0 -1 1367 1367
    data(6,1368) = 1 1 4 0 0 -1 1368 1368
    data(6,1369) = 1 1 4 0 0 -1 1369 1369
    data(6,1370) = 1 1 4 0 0 -1 1370 1370
    data(6,1371) = 1 1 4 0 0 -1 1371 1371
    data(6,1372) = 1 1 4 0 0 -1 1372 1372
    data(6,1373) = 1 1 4 0 0 -1 1373 1373
    data(6,1374) = 1 1 4 0 0 -1 1374 1374
    data(6,1375) = 1 1 4 0 0 -1 1375 1375
    data(6,1376) = 1 1 4 0 0 -1 1376 1376
    data(6,1377) = 1 1 4 0 0 -1 1377 1377
    data(6,1378) = 1 1 4 0 0 -1 1378 1378
    data(6,1379) = 1 1 4 0 0 -1 1379 1379
    data(6,1380) = 1 1 4 0 0 -1 1380 1380
    data(6,1381) = 1 1 4 0 0 -1 1381 1381
    data(6,1382) = 1 1 4 0 0 -1 1382 1382
    data(6,1383) = 1 1 4 0 0 -1 1383 1383
    data(6,1384) = 1 1 4 0 0 -1 1384 1384
    data(6,1385) = 1 1 4 0 0 -1 1385 1385
    data(6,1386) = 1 1 4 0 0 -1 1386 1386
    data(6,1387) = 1 1 4 0 0 -1 1387 1387
    data(6,1388) = 1 1 4 0 0 -1 1388 1388
    data(6,1389) = 1 1 4 0 0 -1 1389 1389
    data(6,1390) = 1 1 4 0 0 -1 1390 1390
    data(6,1391) = 1 1 4 0 0 -1 1391 1391
    data(6,1392) = 1 1 4 0 0 -1 1392 1392
    data(6,1393) = 1 1 4 0 0 -1 1393 1393
    data(6,1394) = 1 1 4 0 0 -1 1394 1394
    data(6,1395) = 1 1 4 0 0 -1 1395 1395
    data(6,1396) = 1 1 4 0 0 -1 1396 1396
    data(6,1397) = 1 1 4 0 0 -1 1397 1397
    data(6,1398) = 1 1 4 0 0 -1 1398 1398
    data(6,1399) = 1 1 4 0 0 -1 1399 1399
    data(6,1400) = 1 1 4 0 0 -1 1400 1400
    data(6,1401) = 1 1 4 0 0 -1 1401 1401
    data(6,1402) = 1 1 4 0 0 -1 1402 1402
    data(6,1403) = 1 1 4 0 0 -1 1403 1403
    data(6,1404) = 1 1 4 0 0 -1 1404 1404
    data(6,1405) = 1 1 4 0 0 -1 1405 1405
    data(6,1406) = 1 1 4 0 0 -1 1406 1406
    data(6,1407) = 1 1 4 0 0 -1 1407 1407
    data(6,1408) = 1 1 4 0 0 -1 1408 1408
    data(6,1409) = 1 1 4 0 0 -1 1409 1409
    data(6,1410) = 1 1 4 0 0 -1 1410 1410
    data(6,1411) = 1 1 4 0 0 -1 1411 1411
    data(6,1412) = 1 1 4 0 0 -1 1412 1412
    data(6,1413) = 1 1 4 0 0 -1 1413 1413
    data(6,1414) = 1 1 4 0 0 -1 1414 1414
    data(6,1415) = 1 1 4 0 0 -1 1415 1415
    data(6,1416) = 1 1 4 0 0 -1 1416 1416
    data(6,1417) = 1 1 4 0 0 -1 1417 1417
    data(6,1418) = 1 1 4 0 0 -1 1418 1418
    data(6,1419) = 1 1 4 0 0 -1 1419 1419
    data(6,1420) = 1 1 4 0 0 -1 1420 1420
    data(6,1421) = 1 1 4 0 0 -1 1421 1421
    data(6,1422) = 1 1 4 0 0 -1 1422 1422
    data(6,1423) = 1 1 4 0 0 -1 1423 1423
    data(6,1424) = 1 1 4 0 0 -1 1424 1424
    data(6,1425) = 1 1 4 0 0 -1 1425 1425
    data(6,1426) = 1 1 4 0 0 -1 1426 1426
    data(6,1427) = 1 1 4 0 0 -1 1427 1427
    data(6,1428) = 1 1 4 0 0 -1 1428 1428
    data(6,1429) = 1 1 4 0 0 -1 1429 1429
    data(6,1430) = 1 1 4 0 0 -1 1430 1430
    data(6,1431) = 1 1 4 0 0 -1 1431 1431
    data(6,1432) = 1 1 4 0 0 -1 1432 1432
    data(6,1433) = 1 1 4 0 0 -1 1433 1433
    data(6,1434) = 1 1 4 0 0 -1 1434 1434
    data(6,1435) = 1 1 4 0 0 -1 1435 1435
    data(6,1436) = 1 1 4 0 0 -1 1436 1436
    data(6,1437) = 1 1 4 0 0 -1 1437 1437
    data(6,1438) = 1 1 4 0 0 -1 1438 1438
    data(6,1439) = 1 1 4 0 0 -1 1439 1439
    data(6,1440) = 1 1 4 0 0 -1 1440 1440
    data(6,1441) = 1 1 4 0 0 -1 1441 1441
    data(6,1442) = 1 1 4 0 0 -1 1442 1442
    data(6,1443) = 1 1 4 0 0 -1 1443 1443
    data(6,1444) = 1 1 4 0 0 -1 1444 1444
    data(6,1445) = 1 1 4 0 0 -1 1445 1445
    data(6,1446) = 1 1 4 0 0 -1 1446 1446
    data(6,1447) = 1 1 4 0 0 -1 1447 1447
    data(6,1448) = 1 1 4 0 0 -1 1448 1448
    data(6,1449) = 1 1 4 0 0 -1 1449 1449
    data(6,1450) = 1 1 4 0 0 -1 1450 1450
    data(6,1451) = 1 1 4 0 0 -1 1451 1451
    data(6,1452) = 1 1 4 0 0 -1 1452 1452
    data(6,1453) = 1 1 4 0 0 -1 1453 1453
    data(6,1454) = 1 1 4 0 0 -1 1454 1454
    data(6,1455) = 1 1 4 0 0 -1 1455 1455
    data(6,1456) = 1 1 4 0 0 -1 1456 1456
    data(6,1457) = 1 1 4 0 0 -1 1457 1457
    data(6,1458) = 1 1 4 0 0 -1 1458 1458
    data(6,1459) = 1 1 4 0 0 -1 1459 1459
    data(6,1460) = 1 1 4 0 0 -1 1460 1460
    data(6,1461) = 1 1 4 0 0 -1 1461 1461
    data(6,1462) = 1 1 4 0 0 -1 1462 1462
    data(6,1463) = 1 1 4 0 0 -1 1463 1463
    data(6,1464) = 1 1 4 0 0 -1 1464 1464
    data(6,1465) = 1 1 4 0 0 -1 1465 1465
    data(6,1466) = 1 1 4 0 0 -1 1466 1466
    data(6,1467) = 1 1 4 0 0 -1 1467 1467
    data(6,1468) = 1 1 4 0 0 -1 1468 1468
    data(6,1469) = 1 1 4 0 0 -1 1469 1469
    data(6,1470) = 1 1 4 0 0 -1 1470 1470
    data(6,1471) = 1 1 4 0 0 -1 1471 1471
    data(6,1472) = 1 1 4 0 0 -1 1472 1472
    data(6,1473) = 1 1 4 0 0 -1 1473 1473
    data(6,1474) = 1 1 4 0 0 -1 1474 1474
    data(6,1475) = 1 1 4 0 0 -1 1475 1475
    data(6,1476) = 1 1 4 0 0 -1 1476 1476
    data(6,1477) = 1 1 4 0 0 -1 1477 1477
    data(6,1478) = 1 1 4 0 0 -1 1478 1478
    data(6,1479) = 1 1 4 0 0 -1 1479 1479
    data(6,1480) = 1 1 4 0 0 -1 1480 1480
    data(6,1481) = 1 1 4 0 0 -1 1481 1481
    data(6,1482) = 1 1 4 0 0 -1 1482 1482
    data(6,1483) = 1 1 4 0 0 -1 1483 1483
    data(6,1484) = 1 1 4 0 0 -1 1484 1484
    data(6,1485) = 1 1 4 0 0 -1 1485 1485
    data(6,1486) = 1 1 4 0 0 -1 1486 1486
    data(6,1487) = 1 1 4 0 0 -1 1487 1487
    data(6,1488) = 1 1 4 0 0 -1 1488 1488
    data(6,1489) = 1 1 4 0 0 -1 1489 1489
    data(6,1490) = 1 1 4 0 0 -1 1490 1490
    data(6,1491) = 1 1 4 0 0 -1 1491 1491
    data(6,1492) = 1 1 4 0 0 -1 1492 1492
    data(6,1493) = 1 1 4 0 0 -1 1493 1493
    data(6,1494) = 1 1 4 0 0 -1 1494 1494
    data(6,1495) = 1 1 4 0 0 -1 1495 1495
    data(6,1496) = 1 1 4 0 0 -1 1496 1496
    data(6,1497) = 1 1 4 0 0 -1 1497 1497
    data(6,1498) = 1 1 4 0 0 -1 1498 1498
    data(6,1499) = 1 1 4 0 0 -1 1499 1499
    data(6,1500) = 1 1 4 0 0 -1 1500 1500


 [W_Modify]
TypeDataItem=12
; 数组个数，数组结构成员个数，字节数，是否字串，是否名称，引用数据类型，名字，说明，是否地图号，标识类型，标识编号
; 间隔使用空格，一定要注意字符串中间不能有空格，而且空格只能有一个，等号后面不能有空格。
Data(0)=1 1 4 0 0 0 编号 地图编号 0 0 0
Data(1)=1 1 10 1 1 0 名称 地图名称 0 0 0
Data(2)=1 1 4 0 0 0 地图号 引用地图编号 1 0 0
Data(3)=1 1 4 0 0 0 经验 地图经验值 0 0 0
Data(4)=1 1 4 0 0 0 音乐 地图所用音乐 0 0 0
Data(5)=6 1 4 0 0 1 队友 参加的队友编号 0 0 5
Data(6)=6 1 4 0 0 1 自动队友 自动队友编号（不为空则读取自动队友） 0 0 7
Data(7)=6 1 4 0 0 0 队友X 队友X坐标 0 1 1
Data(8)=6 1 4 0 0 0 队友Y 队友Y坐标 0 1 2
Data(9)=20 1 4 0 0 1 敌人 敌人队友编号 0 0 6
Data(10)=20 1 4 0 0 0 敌人X 敌人X坐标 0 2 3
Data(11)=20 1 4 0 0 0 敌人Y 敌人Y坐标 0 2 4
selectcontinue=1


[D_modify]
num=11
Attrib0=能否通过
Attrib1=编号
Attrib2=事件1
Attrib3=事件2
Attrib4=事件3
Attrib5=开始贴图
Attrib6=结束贴图
Attrib7=临时贴图
Attrib8=动画延迟
Attrib9=横坐标X
Attrib10=纵坐标Y

[50memory]
;50指令内存表
MemNum=14

Mem0=1C0B90 计秒，每3600/65536秒加1
Mem1=1C0B92 计时，计秒溢出则加1
Mem2=1C0BF8 当前主角贴图号
Mem3=544F2 当前主角面向
Mem4=1D295E 当前场景号
Mem5=1D295C 当前主角座标x
Mem6=1D295A 当前主角座标y
Mem7=1D2958 当前场景座标x
Mem8=1D2956 当前场景座标y
Mem9=1 战斗回合
Mem10=2 倒计时
Mem11=3 当钱事件
Mem12=4 战斗状态（0继续，1胜利，2失败）
Mem13=5 最大战斗人数
Mem14=6 自动刷新开关（0开，用于50指令显示图片、字符串）

[KdefAttrib]
;保存每条指令的属性，请不要更改"
Number=68

Attrib0=0 1 0 0 0 空指令(清屏)
Attrib1=1 4 0 0 0 对话(对话编号,人物头像代号,对话框位置)
Attrib2=2 3 0 0 0 得到物品(物品编号,数量)
Attrib3=3 14 0 0 0 重新修改事件内容
Attrib4=4 4 1 2 3 使用物体触发事件(物品编号,正确转向偏移量,不正确转向偏移量)
Attrib5=5 3 1 1 2 询问是否战斗(是转向偏移量,否转向偏移量) 
Attrib6=6 5 1 2 3 战斗(战斗场景编号,赢转向偏移量,输转向偏移量,输后是否有经验值得)
Attrib7=7 1 0 0 0 无条件返回，事件结束
Attrib8=8 2 0 0 0 改变大地图音乐(0300)
Attrib9=9 3 1 1 2 询问是否加入(是转向偏移量,否转向偏移量)
Attrib10=a 2 0 0 0 加入队员(人物代号) 
Attrib11=b 3 1 1 2 询问是否住宿(是转向偏移量,否转向偏移量) 
Attrib12=c 1 0 0 0 住宿
Attrib13=d 1 0 0 0 场景重新显示
Attrib14=e 1 0 0 0 场景从明亮渐变为暗淡
Attrib15=f 2 0 0 0 死亡回到选单(5300)
Attrib16=10 4 1 2 3 判断某个人是否在队中(人代号,在转向偏移量,不在转向偏移量)
Attrib17=11 6 0 0 0 修改场景的s*贴图(场景编号,图层,横坐标,纵坐标,贴图编号)
Attrib18=12 4 1 2 3 判断是否有某种物品(物品编号,有转向偏移量,没有转向偏移量)
Attrib19=13 3 0 0 0 改变主角当前位置(目标x,目标y) 
Attrib20=14 3 1 1 2 判断队伍是否满(满转向偏移量,不满转向偏移量) 
Attrib21=15 2 0 0 0 队员离队(人代号) 
Attrib22=16 1 0 0 0 内力降为0 
Attrib23=17 3 0 0 0 设置用毒能力(人代号,数值)
Attrib24=18 1 0 0 0 死亡黒色背景
Attrib25=19 5 0 0 0 场景移动(原始x,原始y,目标x,目标y) 
Attrib26=1a 6 0 0 0 增加场景事件编号的三个触发事件编号
Attrib27=1b 4 0 0 0 显示动画(图1,图2,图3)
Attrib28=1c 6 1 4 5 判断品德(人代号,数值下限,数值上限,达到转向偏移量,否转向偏移量)
Attrib29=1d 6 1 4 5 判断武力(人代号,数值下限,数值上限,达到转向偏移量,否转向偏移量) 
Attrib30=1e 5 0 0 0 主角走动(原始x,原始y,目标x,目标y)
Attrib31=1f 4 1 2 3 判断是否够钱(需要钱数,够钱转向偏移量,不够转向偏移量)
Attrib32=20 3 0 0 0 增加物品数量(物品编号,数量) 
Attrib33=21 4 0 0 0 学会武功(人代号,武功编号,[0000显示学会什么武功]) 
Attrib34=22 3 0 0 0 增加资质(人代号,数值) 
Attrib35=23 5 0 0 0 设置武功(人代号,武功栏位,武功编号,武功点数)
Attrib36=24 4 1 2 3 判断主角的性别(主角的性别,是转向偏移量,否转向偏移量)
Attrib37=25 2 0 0 0 设置品德(数值) 
Attrib38=26 5 0 0 0 修改场景贴图(场景编号,图层编号,原有贴图,修改后贴图)
Attrib39=27 2 0 0 0 打开场景(场景编号)
Attrib40=28 2 0 0 0 主角面向何方(站立图编号) 
Attrib41=29 4 0 0 0 非我方队员增加物品(人代号,物品编号,数量) 
Attrib42=2a 3 1 1 2 判断队里是否有女性(是转向偏移量,否转向偏移量)
Attrib43=2b 4 1 2 3 判断物品栏里是否有指定物品(物品编号,有转向偏移量,无转向偏移量) 
Attrib44=2c 7 0 0 0 播放动画
Attrib45=2d 3 0 0 0 增加轻功(人代号,数值)
Attrib46=2e 3 0 0 0 增加内力(人代号,数值)
Attrib47=2f 3 0 0 0 增加武力(人代号,数值)
Attrib48=30 3 0 0 0 增加生命(人代号,数值)
Attrib49=31 3 0 0 0 设置内力属性(人代号,数值)
;    Attrib50=32 8 1 6 7 判断物品栏里是否有指定的5种物品
Attrib50=32 8 0 0 0 判断物品栏里是否有指定的5种物品
Attrib51=33 1 0 0 0 问软体娃娃
Attrib52=34 1 0 0 0 看道德
Attrib53=35 1 0 0 0 看声望
Attrib54=36 1 0 0 0 见过南贤后可以进入各场景
Attrib55=37 5 1 3 4 判断事件编号(事件编号,给定编号,是偏移,否偏移)
Attrib56=38 2 0 0 0 增加声望(数值)
Attrib57=39 1 0 0 0 主角在高昌迷宫砍石门的动画
Attrib58=3a 1 0 0 0 武道大会比武
Attrib59=3b 1 0 0 0 全部队员离队并找不到
Attrib60=3c 6 1 4 5 判断场景某层某图块？？？(？,？,某地一幅图块,是偏移,否偏移)
Attrib61=3d 3 1 1 2 判断是否放完14本书？(是偏移,否偏移) 
Attrib62=3e 7 0 0 0 播放进入时空机动画
Attrib63=3f 3 0 0 0 设置性别(人代号,数值)
Attrib64=40 1 0 0 0 韦小宝卖东西 
Attrib65=41 1 0 0 0 韦小宝去其它客栈
Attrib66=42 2 0 0 0 播放音乐(音乐编号) 
Attrib67=43 2 0 0 0 播放声音(声音编号)
Attrib68=44 8 0 0 0 新对话(头像号,对话号,显示名字,显示位置,是否显示头像,颜色)
Attrib69=45 4 0 0 0 对话替换字符
Attrib70=46 3 0 0 0 显示字幕(对话号，颜色)
Attrib71=47 4 0 0 0 场景跳转(场景编号，X，Y)
Attrib72=48 6 0 0 0 设置人物属性(人物编号,模式,加等级，最低，最高)

; 指令50的含义翻译
[kdef50]

    ; 最大指令个数
    num=50    

    Sub0=变量赋值
    Sub1=数组变量赋值
    Sub2=取数组变量值
    sub3=四则运算
    Sub4=变量判断
    SUB5=全部变量清零
    sub6=定义变量名
    SUb8=读对话到字符串
    Sub9=Sprintf
    Sub10=取字符串长度
    Sub11=字符串合并
    Sub12=空格字符串
    SUb16=保存属性
    SUb17=读取属性
    sub18=保存队伍
    sub19=读取队伍
    sub20=主角200个物品数量
    sub21=保存D*数据
    sub22=读取D*数据
    sub23=保存S*数据
    sub24=读取S*数据
    sub25=保存给定地址数据
    sub26=读取给定地址数据
    sub27=取属性名称
    sub28=取当前人物战斗序号
    sub29=选择攻击目标
    sub30=读取人物战斗属性
    sub31=保存人物战斗属性
    sub32=修改下一条指令
    sub33=显示字符串
    sub34=处理背景
    sub35=读取键盘
    sub36=显示字符串并等待击键
    sub37=延时
    sub38=随机数
    sub39=菜单选择
    sub40=滚动菜单选择
    sub41=显示图片
    sub42=改变主地图坐标
    sub43=调用其它事件
    sub44=播放效果
    sub45=显示数字  
    sub46=设定效果层
    sub47=重置战场贴图 
    sub48=调试指令，显示变量
    sub49=传说中的调用任意子程     

    Other=无

